{
  "case_1": {
    "patient_id": "SIH-2024-1021",
    "name": "Adrian Vale",
    "age": "42 years",
    "sex": "Male",
    "village": "Ward Northbend",
    "civil_status": "Married",
    "occupation": "Farmer / Day laborer",
    "religion": "Roman Catholic",
    "admission_date": "19-Oct-2024",
    "admission_time": "08:40",
    "brought_by": "Wife (Elena Vale)",
    "informant": "Patient and wife",
    "chief_complaint": "High fever, severe calf pain, red eyes for 4 days",

    "history_present_illness": "This is a 42-year-old male farmer from Ward Northbend who was in his usual state of good health until 4 days prior to admission when he developed sudden onset of high-grade fever associated with chills and rigors. The fever was noted to be intermittent, reaching up to 40°C by patient's wife's account using a home thermometer, temporarily relieved by paracetamol but recurring every 6-8 hours.\n\nConcomitantly, the patient noted progressively worsening muscle pain, most pronounced in both calves and the lower back region. The calf pain was described as 'severe' and 'cramping' in nature, rated 8/10 in intensity, aggravated by walking and standing, with minimal relief from rest. By day 2 of illness, the patient reported difficulty ambulating due to the severity of the myalgia.\n\nOn day 2 of illness, the patient's wife noticed that his eyes appeared markedly red, described as 'bloodshot' with associated tearing. There was no eye discharge, itching, or visual disturbances reported. The patient also developed frontal headache, rated 6/10 in intensity, non-throbbing in character.\n\nOn day 3, the patient developed nausea with 2 episodes of non-bilious, non-bloody vomiting. He also noted that his urine had become dark, described as 'tea-colored.' Appetite was markedly decreased. No diarrhea, no abdominal pain, no skin rash, no bleeding manifestations.\n\nBy day 4 (day of admission), the wife noted that the patient appeared confused at times and was increasingly weak, prompting emergency department consultation.\n\n(Note: Detailed exposure and activity history to be obtained by investigating team - patient and family available for interview.)",

    "past_medical_history": "No known chronic medical conditions.\nNo history of diabetes mellitus, hypertension, heart disease, kidney disease, or liver disease.\nNo history of tuberculosis or other pulmonary conditions.\nNo previous hospitalizations or surgeries.\nChildhood immunizations complete per patient report; no recent vaccinations.\nNo known drug allergies.\nNo known food allergies.",

    "family_history": "Father: Deceased, age 68, from stroke.\nMother: Living, age 65, has hypertension controlled on medication.\nSiblings: 2 brothers, 1 sister, all apparently healthy.\nNo family history of kidney disease, liver disease, or bleeding disorders.",

    "personal_social_history": "Tobacco: Former smoker, quit 5 years ago. Previously 1/2 pack per day for 15 years (7.5 pack-years).\nAlcohol: Occasional social drinker, approximately 2-3 beers on weekends.\nIllicit drugs: Denied.\nLives with wife and 3 children (ages 8, 12, 15) in a wooden house with concrete foundation. House has electricity and running water from community tap. Toilet is a pour-flush type shared with one neighboring household.\nEducation: Completed high school.\nIncome: Seasonal farming income supplemented by day labor; family is of modest means.",

    "review_of_systems": "General: Fever, chills, malaise, weakness, decreased appetite, unintentional weight loss (estimated 2-3 kg over past 4 days per wife).\nSkin: No rash, no jaundice noted by patient (wife unsure), no petechiae.\nHEENT: Headache as noted. Red eyes with tearing. No sore throat, no ear pain, no nasal congestion.\nRespiratory: No cough, no shortness of breath, no chest pain.\nCardiovascular: No palpitations, no orthopnea, no leg swelling.\nGastrointestinal: Nausea and vomiting as noted. No abdominal pain. No diarrhea. Dark urine as noted. Normal bowel movements.\nGenitourinary: Dark urine; patient unsure about urine volume but wife notes he has been urinating less frequently.\nMusculoskeletal: Severe myalgia as noted, especially in calves.\nNeurological: Wife reports intermittent confusion; no seizures, no focal weakness.\nHematologic: No easy bruising, no bleeding gums, no blood in stool or urine.",

    "physical_exam_admission": "VITAL SIGNS:\nTemperature: 39.6°C (axillary)\nHeart Rate: 118 bpm, regular\nBlood Pressure: 100/60 mmHg (right arm, supine)\nRespiratory Rate: 22 breaths/min\nOxygen Saturation: 96% on room air\nWeight: 64 kg (usual weight 67 kg per patient)\n\nGENERAL APPEARANCE:\nMiddle-aged male, appears acutely ill and uncomfortable. Lying in bed with eyes closed. Responds appropriately to questions but appears fatigued. Mild jaundice appreciated on inspection.\n\nSKIN:\nWarm and dry. Mild jaundice visible. No rash, no petechiae, no ecchymoses. Multiple healing abrasions noted on both feet and lower legs consistent with reported debris injuries.\n\nHEAD AND NECK:\nNormocephalic, atraumatic. Scleral icterus present bilaterally. CONJUNCTIVAL SUFFUSION NOTED BILATERALLY - marked redness of the conjunctivae without purulent discharge, extending to the limbus. No chemosis. Pupils equal, round, reactive to light. Oral mucosa moist, no lesions. Pharynx non-erythematous. Neck supple, no lymphadenopathy, no thyromegaly, no jugular venous distension.\n\nCHEST/LUNGS:\nSymmetrical chest expansion. No retractions. Clear breath sounds bilaterally on auscultation. No wheezes, rhonchi, or crackles.\n\nCARDIOVASCULAR:\nTachycardic but regular rhythm. Normal S1 and S2. No murmurs, gallops, or rubs. Peripheral pulses palpable and symmetric. Capillary refill time 2 seconds.\n\nABDOMEN:\nSoft, non-distended. Mild tenderness in the right upper quadrant on deep palpation. Liver palpable 2 cm below the right costal margin, non-tender. Spleen not palpable. No masses. Bowel sounds present and normal.\n\nEXTREMITIES:\nNo peripheral edema. MARKED TENDERNESS TO PALPATION OF BOTH CALVES - patient winces and withdraws on examination. Gastrocnemius muscles feel tense bilaterally. No calf swelling or asymmetry. Full range of motion in all joints, though limited by pain. Pulses intact distally.\n\nNEUROLOGICAL:\nAlert but intermittently confused regarding date. Oriented to person and place. Glasgow Coma Scale 14 (E4V4M6). Cranial nerves II-XII grossly intact. Motor strength 5/5 in all extremities (limited assessment due to pain). Sensation intact to light touch. Deep tendon reflexes 2+ and symmetric. No meningeal signs - neck supple, Kernig and Brudzinski signs negative.",

    "investigations_admission": "COMPLETE BLOOD COUNT (19-Oct-2024 09:15):\nWBC: 14,200/μL (Reference: 4,500-11,000)\n  - Neutrophils: 80% (Ref: 40-70%)\n  - Lymphocytes: 14% (Ref: 20-40%)\n  - Monocytes: 5%\n  - Eosinophils: 1%\nHemoglobin: 13.2 g/dL (Ref: 14-18)\nHematocrit: 39%\nPlatelet Count: 165,000/μL (Ref: 150,000-400,000)\n\nCOMPREHENSIVE METABOLIC PANEL (19-Oct-2024 09:15):\nSodium: 134 mEq/L (Ref: 136-145)\nPotassium: 4.8 mEq/L (Ref: 3.5-5.0)\nChloride: 98 mEq/L (Ref: 98-106)\nBicarbonate: 20 mEq/L (Ref: 22-29)\nBUN: 58 mg/dL (Ref: 7-20) - ELEVATED\nCreatinine: 3.9 mg/dL (Ref: 0.7-1.3) - MARKEDLY ELEVATED\nGlucose: 118 mg/dL (Ref: 70-100)\nCalcium: 8.4 mg/dL (Ref: 8.5-10.5)\n\nLIVER FUNCTION TESTS (19-Oct-2024 09:15):\nTotal Bilirubin: 3.2 mg/dL (Ref: 0.1-1.2) - ELEVATED\nDirect Bilirubin: 2.1 mg/dL (Ref: 0-0.3) - ELEVATED\nAST (SGOT): 124 U/L (Ref: 10-40) - ELEVATED\nALT (SGPT): 98 U/L (Ref: 7-56) - ELEVATED\nAlkaline Phosphatase: 145 U/L (Ref: 44-147)\nAlbumin: 3.2 g/dL (Ref: 3.5-5.0)\nTotal Protein: 6.8 g/dL (Ref: 6.0-8.3)\n\nURINALYSIS (19-Oct-2024 09:30):\nColor: Dark amber\nClarity: Hazy\nSpecific Gravity: 1.025\npH: 5.5\nProtein: 2+ (Ref: Negative)\nGlucose: Negative\nKetones: 1+\nBilirubin: 2+\nBlood: 1+ (Ref: Negative)\nWBC: 5-10/HPF (Ref: 0-5)\nRBC: 10-15/HPF (Ref: 0-2)\nCasts: Occasional granular casts seen\nBacteria: Few\n\nRAPID DIAGNOSTIC TESTS (19-Oct-2024 10:00):\nDengue NS1 Antigen: NEGATIVE\nDengue IgM/IgG: NEGATIVE\nMalaria RDT (Pf/Pv): NEGATIVE\n\nCHEST X-RAY (19-Oct-2024 10:30):\nFindings: Heart size normal. Lungs are clear. No infiltrates, effusions, or consolidation. No cardiomegaly. Mediastinum is normal. Bones intact.\nImpression: Normal chest radiograph.\n\nECG (19-Oct-2024 10:45):\nRate: 115 bpm\nRhythm: Sinus tachycardia\nAxis: Normal\nIntervals: PR 0.16s, QRS 0.08s, QTc 0.44s\nST-T changes: None\nImpression: Sinus tachycardia, otherwise normal ECG.",

    "initial_diagnosis": "1. Acute febrile illness with multi-organ involvement - suspect infectious etiology\n2. Acute kidney injury (KDIGO Stage 3)\n3. Hepatitis - likely secondary to systemic infection\n4. Dehydration",

    "differential_diagnosis": "WORKING DIFFERENTIAL DIAGNOSIS (in order of likelihood based on clinical presentation):\n\n1. Leptospirosis - HIGH SUSPICION\n   - Classic clinical triad: fever + conjunctival suffusion + myalgia (especially calf)\n   - Multi-organ involvement (kidney, liver)\n   - Post-typhoon period in endemic area\n   - Exposure history to be clarified by investigating team\n\n2. Severe Dengue\n   - Fever with thrombocytopenia risk\n   - However: Dengue RDT negative, no rash, no bleeding, platelet count normal\n   - Less likely given negative serology\n\n3. Murine Typhus\n   - Fever, headache, myalgia\n   - Usually has rash (not present)\n\n4. Typhoid Fever\n   - Prolonged fever, hepatomegaly\n   - However: Typically stepladder fever, usually GI symptoms more prominent\n\n5. Acute Viral Hepatitis (Hepatitis A/E)\n   - Jaundice, elevated liver enzymes\n   - However: Would not explain myalgia or conjunctival suffusion\n\n6. Bacterial Sepsis\n   - Has healing wounds on feet noted on exam\n   - However: Would expect more localized signs, higher WBC",

    "initial_treatment_plan": "1. ADMIT to Medical Ward (consider ICU if deteriorates)\n2. IV ACCESS: Insert 2 large-bore peripheral IVs\n3. IV FLUIDS: Normal Saline 1L bolus, then 100 mL/hr - titrate to urine output goal >0.5 mL/kg/hr\n4. ANTIBIOTICS: IV Ceftriaxone 1g every 12 hours (empiric coverage pending confirmatory tests)\n5. SYMPTOMATIC:\n   - Paracetamol 500mg IV every 6 hours for fever (avoid NSAIDs given renal impairment)\n   - Ondansetron 4mg IV every 8 hours PRN for nausea\n6. MONITORING:\n   - Strict intake/output charting\n   - Foley catheter for accurate urine output monitoring\n   - Vital signs every 4 hours\n   - Daily weight\n   - Neuro checks every 4 hours\n7. LABORATORY:\n   - Repeat renal function in 24 hours\n   - Blood culture x 2 sets\n   - Urine culture\n   - Leptospira serology (IgM ELISA) - SEND\n   - Leptospira PCR if available - SEND\n   - Hepatitis A and E serology\n8. DIET: NPO until nausea resolves, then clear liquids\n9. NEPHROLOGY consult for AKI management\n10. NOTIFY: District Health Office per outbreak surveillance protocol",

    "nursing_notes": "19-Oct-2024 09:00 - Admission nursing assessment completed. Patient arrived via ambulance with wife. Alert but appears weak and ill. IV access established (20G right forearm). Foley catheter inserted, initial residual 150mL dark amber urine. Oriented to person and place, intermittently confused about date. Wife at bedside providing history. Fall risk precautions initiated. - RN M. Santos\n\n19-Oct-2024 12:00 - Vital signs: T 39.2°C, HR 110, BP 105/65, RR 20, SpO2 97% RA. Patient resting in bed. Tolerated clear liquids. Urine output past 4 hours: 80 mL (dark amber). Continued IV fluids as ordered. Patient complained of calf pain, rated 7/10. - RN M. Santos\n\n19-Oct-2024 16:00 - Vital signs: T 38.8°C, HR 108, BP 102/62, RR 18, SpO2 96% RA. Patient sleeping, easily arousable. Urine output past 4 hours: 65 mL. Noted to be more confused this afternoon, asking repeatedly where he is. Wife remains at bedside. Notified resident physician of decreased UOP and confusion. - RN J. Cruz\n\n19-Oct-2024 20:00 - Vital signs: T 39.4°C, HR 115, BP 98/58, RR 22, SpO2 95% RA. Patient more lethargic this evening. Urine output past 4 hours: 45 mL (OLIGURIA). Eyes remain markedly red. Skin appears more yellow. Resident physician at bedside, ordered fluid bolus and repeat labs. - RN J. Cruz\n\n19-Oct-2024 23:00 - Vital signs: T 38.6°C, HR 112, BP 100/60, RR 20, SpO2 96% RA. After 500mL NS bolus. Patient sleeping. Urine output slightly improved, 60 mL past 3 hours. Night shift continuing close monitoring. - RN A. Reyes\n\n20-Oct-2024 06:00 - Night shift summary: Patient had restless night with intermittent confusion. Total urine output past 8 hours: 180 mL. AM labs drawn. Vital signs stable but remains febrile. Wife slept in chair beside patient. - RN A. Reyes",

    "progress_notes": "--- PROGRESS NOTE: 20-Oct-2024 (Hospital Day 2) ---\nS: Patient reports persistent fever and severe calf pain. Wife notes he was confused during the night, not recognizing her briefly. Minimal appetite. Denies chest pain, shortness of breath. Noticed decreased urination.\n\nO: T 38.9°C, HR 108, BP 95/60, RR 20, SpO2 96% RA\nGeneral: Ill-appearing, mild jaundice more pronounced today\nConjunctivae: Persistent bilateral suffusion\nLungs: Clear\nAbdomen: Soft, mild RUQ tenderness, liver edge palpable\nExtremities: Persistent severe calf tenderness, no edema\nNeuro: Alert but slow to respond, oriented x2 (person, place)\n\nLabs (20-Oct AM):\n- Creatinine: 4.5 mg/dL (↑ from 3.9) - WORSENING\n- BUN: 68 mg/dL (↑ from 58)\n- Potassium: 5.2 mEq/L (↑ from 4.8)\n- Total bilirubin: 4.1 mg/dL (↑ from 3.2)\n- Platelet count: 142,000/μL (↓ from 165,000)\n- Urine output past 24h: 380 mL (OLIGURIA)\n\nA:\n1. Acute febrile illness, likely leptospirosis given clinical syndrome and exposure history - awaiting confirmatory serology\n2. Acute kidney injury, KDIGO Stage 3, worsening - now oliguric\n3. Hepatic involvement with rising bilirubin\n4. Mild thrombocytopenia - monitor for bleeding\n\nP:\n1. Continue IV Ceftriaxone\n2. Fluid management: Restrict to insensible losses + urine output given worsening AKI and oliguria\n3. Nephrology following - may need dialysis if continues to worsen\n4. Monitor for pulmonary edema given fluid status and renal failure\n5. Check coagulation studies\n6. Continue strict I/O monitoring\n7. Repeat labs in PM\n\n- Dr. A. Reyes, PGY-2 Internal Medicine\n\n--- PROGRESS NOTE: 21-Oct-2024 (Hospital Day 3) ---\nS: Patient and wife report worsening. Patient now minimally responsive at times. Wife very concerned. No urine output overnight per nursing.\n\nO: T 38.4°C, HR 122, BP 88/52, RR 28, SpO2 92% on 2L NC\nGeneral: Obtunded, responds only to painful stimuli at times. Marked jaundice.\nLungs: Bibasilar crackles noted - NEW\nCardiac: Tachycardic, no murmur\nAbdomen: Distended, decreased bowel sounds\nExtremities: 1+ pedal edema bilaterally - NEW\n\nLabs (21-Oct AM):\n- Creatinine: 5.8 mg/dL - WORSENING\n- Potassium: 5.8 mEq/L - CRITICAL\n- BUN: 82 mg/dL\n- Total bilirubin: 6.2 mg/dL\n- Platelets: 118,000/μL - DOWNTRENDING\n- ABG: pH 7.28, pCO2 32, pO2 68, HCO3 15 (metabolic acidosis with respiratory compensation)\n- Urine output past 24h: 120 mL (severe oliguria/anuria)\n\nCXR: New bilateral infiltrates, ? pulmonary edema vs ARDS\n\nA:\n1. Severe leptospirosis with multi-organ dysfunction\n   - Weil's disease presentation (jaundice + renal failure)\n2. Acute kidney injury requiring renal replacement therapy\n3. Hypotension requiring ICU monitoring\n4. Acute respiratory distress - pulmonary involvement vs volume overload\n5. Severe metabolic acidosis\n6. Hyperkalemia - CRITICAL\n\nP:\n1. TRANSFER TO ICU IMMEDIATELY\n2. Emergency nephrology consult for URGENT HEMODIALYSIS\n3. Calcium gluconate 1g IV for cardioprotection from hyperkalemia\n4. Kayexalate 30g PO/PR\n5. Increase O2 support as needed\n6. Continue antibiotics\n7. Consider vasopressors if hypotension persists\n8. Update family on critical condition\n\n- Dr. C. Mendoza, Medicine Attending\n\n--- ICU PROGRESS NOTE: 22-Oct-2024 (Hospital Day 4) ---\nS: Patient intubated, sedated. Wife updated this morning.\n\nO: Intubated on VC-AC, FiO2 50%, PEEP 8. ABG improving.\nVS: T 37.8°C, HR 98, BP 110/65 (on low-dose norepinephrine), CVP 12\nSedated, RASS -3. Pupils reactive.\nVentilator: TV 450, RR 16, SpO2 98%\nUrine output: 50 mL in past 6 hours post-dialysis\n\nHemodialysis initiated yesterday - 3-hour session completed.\nPost-HD labs:\n- Creatinine: 4.2 mg/dL (improved)\n- Potassium: 4.5 mEq/L (normalized)\n- BUN: 52 mg/dL (improved)\n\nA:\n1. Severe leptospirosis with multi-organ dysfunction - STABILIZING\n2. AKI requiring dialysis - responding\n3. Respiratory failure - intubated, improving on current settings\n4. Hemodynamically improved on low-dose vasopressors\n\nP:\n1. Continue hemodialysis - plan for session tomorrow\n2. Wean vasopressors as tolerated\n3. Daily awakening trial when stable\n4. Continue IV Ceftriaxone (Day 4)\n5. DVT prophylaxis\n6. Await Leptospira serology results\n\n- Dr. L. Tan, ICU Attending\n\n--- ICU PROGRESS NOTE: 24-Oct-2024 (Hospital Day 6) ---\nS: Patient extubated yesterday, doing well. Alert and oriented. Asking about family.\n\nO: T 37.2°C, HR 82, BP 118/72 (off vasopressors), RR 18, SpO2 97% on 2L NC\nAlert, oriented x3, appropriate. Jaundice markedly improved.\nLungs: Clearing, minimal crackles at bases\nUrine output: 800 mL yesterday - IMPROVING\n\nLabs:\n- Creatinine: 2.4 mg/dL (improving, off dialysis x 48h)\n- Bilirubin: 2.8 mg/dL (improving)\n- Platelets: 156,000 (recovering)\n\n*** SEROLOGY RESULTS RECEIVED ***\nLeptospira IgM ELISA: POSITIVE\nLeptospira MAT: Pending (sent to reference lab)\n\nA:\n1. CONFIRMED LEPTOSPIROSIS - serology positive\n2. Multi-organ dysfunction - RESOLVING\n3. AKI - recovering, no longer requiring dialysis\n4. S/P respiratory failure - extubated, stable\n\nP:\n1. Continue Ceftriaxone to complete 7-day course\n2. Transfer to ward today\n3. Advance diet as tolerated\n4. Physical therapy consult\n5. Continue monitoring renal function\n6. District Health notification completed\n7. Discharge planning - anticipate 2-3 more days if continues to improve\n\n- Dr. L. Tan, ICU Attending",

    "discharge_summary": "DISCHARGE SUMMARY\n\nPatient: Adrian Vale\nMRN: SIH-2024-1021\nAdmission Date: 19-Oct-2024\nDischarge Date: 27-Oct-2024 (9-day hospitalization)\n\nFINAL DIAGNOSES:\n1. Severe Leptospirosis (Weil's Disease) - confirmed by positive IgM ELISA\n2. Acute Kidney Injury (KDIGO Stage 3) - required hemodialysis x 3 sessions, recovered\n3. Acute Respiratory Failure - required mechanical ventilation x 2 days, recovered\n4. Septic Shock - required vasopressor support, resolved\n\nHOSPITAL COURSE SUMMARY:\n42-year-old male farmer admitted with fever, severe calf myalgia, conjunctival suffusion, and jaundice. Rapidly progressed to multi-organ dysfunction requiring ICU admission on hospital day 3. Required intubation, hemodialysis, and vasopressor support. Responded well to IV Ceftriaxone and supportive care. Leptospira IgM confirmed positive on hospital day 6. Gradually improved with return of renal function and successful extubation. Discharged in stable condition with improving renal function.\n\nDISCHARGE MEDICATIONS:\n1. Doxycycline 100mg PO twice daily x 7 days (to complete antibiotic course)\n2. Paracetamol 500mg PO every 6 hours PRN for pain\n3. Omeprazole 20mg PO daily x 2 weeks\n\nFOLLOW-UP:\n1. Nephrology clinic in 1 week for repeat renal function tests\n2. Infectious disease clinic in 2 weeks\n3. Return immediately if: recurrent fever, decreased urination, bleeding, jaundice worsening\n\nPATIENT EDUCATION:\n- Discussed diagnosis of leptospirosis and transmission (contact with contaminated water/animal urine through skin breaks)\n- Emphasized importance of protective footwear during flood exposure\n- Discussed cleaning and disinfecting wounds promptly\n- Advised household members to seek care if similar symptoms develop\n\nDISCHARGE CONDITION: Stable, improved. Ambulatory with assistance.\n\nDictated by: Dr. A. Reyes, PGY-2 Internal Medicine\nAttending: Dr. C. Mendoza, Internal Medicine",

    "outcome": "Survived after ICU stay; confirmed leptospirosis"
  },

  "case_2": {
    "patient_id": "SIH-2024-1027",
    "name": "Luz Fernandez",
    "age": "38 years",
    "sex": "Female",
    "village": "Ward Northbend",
    "civil_status": "Married",
    "occupation": "Housewife / Occasional laundry worker",
    "religion": "Roman Catholic",
    "admission_date": "17-Oct-2024",
    "admission_time": "21:05",
    "brought_by": "Husband (Mario Fernandez)",
    "informant": "Husband (patient too ill to provide history)",
    "chief_complaint": "Fever for 3 days, yellow skin, decreased urination",

    "history_present_illness": "This is a 38-year-old female from Ward Northbend, brought to the emergency room by her husband due to high fever, jaundice, and decreased urination.\n\nPer husband's account, the patient was in her usual state of health until 5 days prior to admission when she developed mild body aches which she attributed to fatigue from recent activities. Three days prior to admission, she developed sudden onset of high-grade fever with chills. The fever was persistent and reportedly reached 40°C by thermometer at home. Paracetamol provided only temporary relief lasting 3-4 hours.\n\nTwo days prior to admission, the patient complained of severe muscle pain, particularly in both calves and thighs. The pain was described as 'very severe' and prevented her from doing household chores. She also developed severe headache, primarily frontal, and noticed that her eyes had become 'very red.' Her husband noted she appeared to have 'pink tears' when crying from the pain.\n\nOne day prior to admission, the husband noticed that the patient's skin and eyes were becoming yellow. She complained of nausea and had several episodes of vomiting. Her urine became dark, described as 'like Coca-Cola.' Most concerning to the husband, she appeared to be urinating very little despite drinking fluids.\n\nOn the day of admission, the patient became increasingly drowsy and confused, not recognizing her children at times. This prompted the husband to bring her to the emergency department.\n\nNote on physical exam: Multiple healing lacerations noted on both hands, one larger wound on right palm (~2cm) with surrounding erythema and mild purulent discharge. Dry, cracked skin on feet consistent with eczema.\n\n(Note: Detailed exposure and activity history to be obtained by investigating team - patient's husband available for interview.)",

    "past_medical_history": "- Known to have mild eczema affecting hands and feet, worsened during rainy season. Uses over-the-counter moisturizing cream.\n- Two prior uncomplicated pregnancies (vaginal deliveries 2015 and 2018, both healthy children).\n- Possible history of urinary tract infection 2 years ago, treated with antibiotics (patient cannot recall specific medication).\n- No known diabetes, hypertension, kidney disease, or liver disease.\n- No previous surgeries or hospitalizations.\n- Immunizations: Childhood vaccines completed; no recent vaccinations; no tetanus booster in past 10 years.\n- No known drug allergies.\n- No known food allergies.",

    "family_history": "Father: Living, age 62, has diabetes mellitus type 2.\nMother: Living, age 58, apparently healthy.\nSiblings: 1 brother with hypertension, 2 sisters apparently healthy.\nNo family history of kidney disease, liver disease, autoimmune conditions, or bleeding disorders.",

    "personal_social_history": "Tobacco: Never smoked.\nAlcohol: Rare social drinking, less than once monthly.\nIllicit drugs: Denied.\n\nLiving situation: Lives with husband (40, construction worker) and 2 children (ages 6 and 9) in a small concrete house in Ward Northbend. House is located in a low-lying area that floods annually during typhoon season. This year's flooding was reportedly worse than usual, with water reaching knee-height inside the house.\n\nWater and sanitation: Community water supply from deep well pump; pour-flush toilet connected to septic tank; no sewage system in area.\n\nOccupation: Primarily housewife; takes in laundry occasionally for extra income. Husband works as a construction laborer.\n\nEducation: Completed 2nd year high school.\n\nFinancial status: Low income; family depends on husband's daily wages; no health insurance (will need financial assistance for hospital bills).",

    "review_of_systems": "General: High fever, chills, severe fatigue, weakness, decreased appetite, possible weight loss (clothes feel loose per husband).\n\nSkin: Yellowish discoloration of skin noted by husband starting 1 day ago. Chronic eczema on hands/feet (worsened recently). Multiple healing cuts on hands.\n\nHEENT: Severe headache (frontal). Red eyes noted 2 days ago with tearing - 'pink tears' noted by husband. Mild sore throat initially. No ear pain, no visual changes.\n\nRespiratory: Mild cough started today, non-productive. No significant shortness of breath until today. No hemoptysis.\n\nCardiovascular: Palpitations noted with fever. No chest pain. No leg swelling until today.\n\nGastrointestinal: Nausea with multiple episodes of vomiting (non-bloody, non-bilious). Decreased appetite for 3 days. No diarrhea. No abdominal pain. Dark urine for 1 day.\n\nGenitourinary: Markedly decreased urination for 2 days per husband. Last menstrual period: 2 weeks ago, normal.\n\nMusculoskeletal: Severe muscle pain, especially bilateral calves and thighs. Also back pain. Joint pain in knees.\n\nNeurological: Confusion and drowsiness starting today. No seizures, no focal weakness observed.\n\nHematologic: No bleeding gums, no nosebleeds, no blood in vomit or stool. Husband unsure about bruising.",

    "physical_exam_admission": "VITAL SIGNS (17-Oct-2024 21:20):\nTemperature: 40.0°C (rectal)\nHeart Rate: 124 bpm, regular\nBlood Pressure: 90/55 mmHg (right arm, supine) - HYPOTENSIVE\nRespiratory Rate: 26 breaths/min\nOxygen Saturation: 93% on room air\nWeight: 52 kg (unable to obtain usual weight, husband estimates ~55 kg)\n\nGENERAL APPEARANCE:\nMiddle-aged female, appears acutely ill, toxic-appearing. Lying in stretcher with eyes closed. Responds to voice but confused and disoriented. MARKED JAUNDICE evident on inspection. Appears dehydrated.\n\nSKIN:\nWarm, jaundiced. Turgor slightly decreased. No petechiae or purpura visualized. Multiple healing lacerations on both hands, one larger wound on right palm (~2cm) with surrounding erythema and mild purulent discharge - INFECTED WOUND. Dry, cracked skin on feet consistent with eczema.\n\nHEAD AND NECK:\nNormocephalic. Marked scleral icterus. PROMINENT CONJUNCTIVAL SUFFUSION BILATERALLY - intense redness without discharge, very striking. Pupils equal, round, reactive. Dry oral mucosa. No oral lesions. Pharynx mildly erythematous. Neck supple, no meningismus. Small, non-tender cervical lymphadenopathy bilaterally.\n\nCHEST/LUNGS:\nTachypneic. Mild bibasilar crackles on auscultation. No wheezes or rhonchi. Chest expansion symmetric.\n\nCARDIOVASCULAR:\nTachycardic, regular rhythm. Normal S1, S2. No murmurs, gallops, or rubs. Weak peripheral pulses. Capillary refill time 3-4 seconds - DELAYED.\n\nABDOMEN:\nSoft, mildly distended. Diffuse mild tenderness, worse in right upper quadrant. HEPATOMEGALY - liver edge palpable 3-4 cm below right costal margin, mildly tender. Spleen tip possibly palpable. No guarding or rebound. Bowel sounds hypoactive.\n\nEXTREMITIES:\nMild bilateral lower extremity edema (1+). SEVERE TENDERNESS OF BOTH CALVES AND THIGHS on palpation - patient moans and withdraws. Muscle compartments feel tense. No calf asymmetry to suggest DVT. Range of motion limited by pain.\n\nNEUROLOGICAL:\nDrowsy but arousable. Confused - oriented only to person. Does not know date, location, or situation. Glasgow Coma Scale 13 (E3V4M6). Following simple commands inconsistently. Cranial nerves grossly intact. Moving all extremities spontaneously. Unable to assess strength formally due to patient's condition. Reflexes symmetric and present. No obvious focal deficits. Kernig and Brudzinski signs negative.",

    "investigations_admission": "COMPLETE BLOOD COUNT (17-Oct-2024 21:45):\nWBC: 15,800/μL (Reference: 4,500-11,000) - ELEVATED\n  - Neutrophils: 82%\n  - Lymphocytes: 12%\n  - Monocytes: 5%\n  - Eosinophils: 1%\nHemoglobin: 11.8 g/dL (Ref: 12-16 for females)\nHematocrit: 35%\nPlatelet Count: 130,000/μL (Ref: 150,000-400,000) - MILD THROMBOCYTOPENIA\n\nCOMPREHENSIVE METABOLIC PANEL (17-Oct-2024 21:45):\nSodium: 131 mEq/L (Ref: 136-145) - LOW\nPotassium: 5.5 mEq/L (Ref: 3.5-5.0) - ELEVATED\nChloride: 96 mEq/L\nBicarbonate: 16 mEq/L (Ref: 22-29) - LOW (metabolic acidosis)\nBUN: 76 mg/dL (Ref: 7-20) - MARKEDLY ELEVATED\nCreatinine: 4.6 mg/dL (Ref: 0.5-1.1) - MARKEDLY ELEVATED\nGlucose: 98 mg/dL\nCalcium: 7.8 mg/dL (Ref: 8.5-10.5) - LOW\n\nLIVER FUNCTION TESTS (17-Oct-2024 21:45):\nTotal Bilirubin: 5.1 mg/dL (Ref: 0.1-1.2) - MARKEDLY ELEVATED\nDirect Bilirubin: 3.8 mg/dL - predominantly conjugated\nAST (SGOT): 245 U/L (Ref: 10-35) - ELEVATED\nALT (SGPT): 178 U/L (Ref: 7-45) - ELEVATED\nAlkaline Phosphatase: 168 U/L\nAlbumin: 2.8 g/dL (Ref: 3.5-5.0) - LOW\nTotal Protein: 6.2 g/dL\nLDH: 580 U/L (Ref: 140-280) - ELEVATED\n\nCOAGULATION STUDIES (17-Oct-2024 22:00):\nPT: 15.2 seconds (Control: 12.0) - mildly prolonged\nINR: 1.3\naPTT: 38 seconds (Ref: 25-35) - mildly prolonged\n\nURINALYSIS (17-Oct-2024 22:15):\nColor: Dark brown ('coca-cola colored')\nClarity: Turbid\nSpecific Gravity: 1.028\npH: 5.0\nProtein: 3+ - SIGNIFICANT PROTEINURIA\nGlucose: Negative\nBilirubin: 3+\nUrobilinogen: Elevated\nBlood: 2+ - HEMATURIA\nWBC: 10-20/HPF\nRBC: 25-50/HPF\nCasts: Granular casts 2-5/LPF, occasional RBC casts seen - CONCERNING\nBacteria: Moderate\n\nARTERIAL BLOOD GAS (17-Oct-2024 22:30):\npH: 7.30 (Ref: 7.35-7.45) - ACIDOTIC\npCO2: 28 mmHg (Ref: 35-45) - respiratory compensation\npO2: 72 mmHg on room air (Ref: 80-100) - HYPOXEMIC\nHCO3: 14 mEq/L - metabolic acidosis\nBase Excess: -10\nLactate: 3.8 mmol/L (Ref: <2.0) - ELEVATED\n\nRAPID DIAGNOSTIC TESTS (17-Oct-2024 22:00):\nDengue NS1 Antigen: NEGATIVE\nDengue IgM/IgG Rapid Test: NEGATIVE\nMalaria RDT (Pf/Pv): NEGATIVE\nHepatitis B Surface Antigen: NEGATIVE\nUrine Pregnancy Test: NEGATIVE\n\nCHEST X-RAY (17-Oct-2024 23:15):\nFindings: Cardiac silhouette at upper limits of normal. Bilateral patchy airspace opacities in lower lung zones. Small bilateral pleural effusions cannot be excluded. No pneumothorax.\nImpression: Bilateral lower lobe airspace disease - differential includes pneumonia, pulmonary edema, or pulmonary hemorrhage in appropriate clinical context.\n\nECG (17-Oct-2024 23:00):\nRate: 120 bpm\nRhythm: Sinus tachycardia\nAxis: Normal\nIntervals: PR 0.14s, QRS 0.08s, QTc 0.48s (prolonged)\nPeaked T waves noted in precordial leads - ? hyperkalemia effect\nNo ST elevation or depression\nImpression: Sinus tachycardia with peaked T waves concerning for hyperkalemia. Prolonged QTc.\n\nBLOOD CULTURES: 2 sets drawn from separate sites - PENDING\nURINE CULTURE: Sent - PENDING",

    "initial_diagnosis": "1. Severe acute febrile illness with multi-organ dysfunction - HIGH SUSPICION FOR LEPTOSPIROSIS (Weil's Disease)\n2. Acute kidney injury, KDIGO Stage 3, oliguric\n3. Acute hepatitis with hyperbilirubinemia\n4. Sepsis with hypotension (septic shock)\n5. Metabolic acidosis with hyperlactatemia\n6. Respiratory failure with bilateral pulmonary infiltrates\n7. Hyperkalemia\n8. Infected wound, right hand\n9. Thrombocytopenia",

    "differential_diagnosis": "PRIMARY CONSIDERATION:\nLeptospirosis (Weil's Disease) - HIGH SUSPICION\n- Classic syndrome: fever + jaundice + renal failure + conjunctival suffusion + severe myalgia\n- Multi-organ involvement consistent with severe leptospirosis\n- Post-typhoon period in endemic area\n- Exposure history to be clarified by investigating team\n\nOTHER DIFFERENTIALS TO CONSIDER:\n1. Severe Dengue with organ dysfunction\n   - Against: Dengue serology negative, no significant bleeding, no rash\n\n2. Viral hemorrhagic fever\n   - Against: No significant hemorrhagic manifestations, less likely epidemiologically\n\n3. Severe Malaria (P. falciparum)\n   - Against: Malaria RDT negative, not classic malaria presentation\n\n4. Acute Viral Hepatitis (A or E) with renal involvement\n   - Against: Does not explain myalgia, conjunctival suffusion, or rapidity of multi-organ failure\n\n5. Hantavirus\n   - Consider given post-flood setting, but presentation more typical of leptospirosis\n\n6. Bacterial sepsis from infected wound\n   - Possible contributor but does not explain full syndrome\n\n7. Scrub typhus\n   - Possible but would expect eschar, and full syndrome more consistent with leptospirosis",

    "initial_treatment_plan": "CRITICAL PATIENT - ICU ADMISSION REQUIRED\n\n1. AIRWAY/BREATHING:\n   - Supplemental O2 via non-rebreather mask, titrate to SpO2 >94%\n   - Prepare for possible intubation if respiratory status worsens\n   - Continuous pulse oximetry\n\n2. CIRCULATION:\n   - 2 large-bore IV access (16-18G)\n   - IV Normal Saline 1L bolus over 30 minutes, reassess\n   - If hypotension persists after 2L fluid, start Norepinephrine infusion\n   - Arterial line for continuous BP monitoring\n   - Central venous catheter for CVP monitoring and vasopressor administration\n\n3. RENAL:\n   - Foley catheter - strict I/O monitoring\n   - URGENT Nephrology consult for hemodialysis - indications: hyperkalemia, metabolic acidosis, volume overload, uremic encephalopathy\n   - Calcium gluconate 1g IV over 10 minutes for cardiac protection from hyperkalemia\n   - Insulin 10 units IV + D50W 25g IV for potassium shifting\n   - Kayexalate 30g PO/NG if able\n\n4. INFECTION:\n   - IV Ceftriaxone 1g every 12 hours (covers leptospirosis and other bacterial infections)\n   - Consider adding IV Azithromycin 500mg daily for atypical coverage\n   - Wound care: Clean and dress right hand wound, consider I&D if abscess\n\n5. MONITORING:\n   - Continuous cardiac monitoring\n   - Vital signs every 1 hour\n   - Neuro checks every 2 hours\n   - Repeat labs in 6 hours (renal function, K+, blood gas)\n   - Daily CBC, CMP, LFTs\n\n6. ADDITIONAL:\n   - NPO\n   - DVT prophylaxis - hold until coagulopathy addressed and platelets stable\n   - Stress ulcer prophylaxis: IV Pantoprazole 40mg daily\n   - Correct hypocalcemia cautiously\n   - Blood bank: Type and screen, have 2 units PRBC available\n\n7. DIAGNOSTICS:\n   - Leptospira IgM ELISA - SEND URGENTLY\n   - Leptospira PCR if available\n   - Hepatitis A IgM, Hepatitis E IgM\n   - Procalcitonin\n   - Repeat CXR in AM or sooner if deteriorates\n\n8. COMMUNICATION:\n   - Update husband on critical condition\n   - Notify District Health Office\n   - Social work consult for financial assistance\n\n- Dr. R. Pascual, Emergency Medicine",

    "nursing_notes": "17-Oct-2024 21:30 - Patient arrived via private vehicle with husband. Immediately noted to be jaundiced and confused. VS concerning for septic shock. Two large bore IVs placed. O2 via NRM started. Foley inserted with minimal dark output (~50mL). Notified ER physician. Patient kept warm with blankets. Husband very anxious, provided emotional support and obtained history. - RN T. Lopez, ER\n\n17-Oct-2024 23:00 - Transferred to ICU. Receiving NS fluid bolus, third liter ongoing. BP improved slightly to 95/60 after 2L fluids. Still on NRM O2, SpO2 94%. Patient confused, responding to name only. Husband accompanied to ICU, updated by ICU team. Continuous cardiac monitoring initiated. - RN T. Lopez, ER / RN S. Garcia, ICU\n\n18-Oct-2024 02:00 - Norepinephrine infusion started at 0.05 mcg/kg/min for persistent hypotension despite 3L crystalloid. BP now 100/62. Central line placed in right IJ without complication. Nephrology saw patient, emergent dialysis planned for AM due to refractory hyperkalemia (K+ now 6.0 despite medical management) and severe acidosis. Temp 39.2°C, gave scheduled paracetamol. Urine output past 4 hours: 20mL. Patient more obtunded. - RN S. Garcia, ICU\n\n18-Oct-2024 06:00 - Patient had desaturation episode overnight, SpO2 dropped to 86% on NRM. Placed on high-flow nasal cannula 40L/60% FiO2, SpO2 now 93%. CXR showed worsening bilateral infiltrates. Intubation equipment at bedside. ABG showed worsening acidosis. Dialysis team called, emergent HD being arranged. Patient unresponsive to voice, withdraws to pain only. Husband stayed overnight in waiting area, will update this morning. - RN A. Cortez, ICU Night\n\n18-Oct-2024 08:30 - Patient intubated at 07:45 due to worsening respiratory failure and decreased consciousness. Intubation uncomplicated, ETT confirmed by CXR. Now on mechanical ventilation AC mode, FiO2 70%, PEEP 10. Post-intubation BP dropped to 85/50, norepinephrine increased to 0.1 mcg/kg/min with improvement. Dialysis catheter being placed for emergent HD. Husband updated on critical condition, appeared distraught, pastor called per family request. - RN D. Santos, ICU\n\n18-Oct-2024 14:00 - First hemodialysis session completed (3 hours). Tolerated well, BP maintained with vasopressor support. Post-HD K+ improved to 4.8 mEq/L, creatinine still elevated 4.2 mg/dL. Patient remains intubated and sedated. FiO2 able to wean to 50%. Urine output still minimal. Team updated husband, explained ongoing critical illness and guarded prognosis. Husband asking about bills, social work notified. - RN D. Santos, ICU\n\n19-Oct-2024 06:00 - Night relatively stable. Norepinephrine weaned to 0.05 mcg/kg/min. Second HD session scheduled for today. Patient opening eyes to voice when sedation lightened, following simple commands. Fever trending down, Tmax overnight 38.4°C. Jaundice persists but husband notes skin looks 'slightly less yellow.' Urine output improving slightly - 150mL over past 12 hours. Continue current management. - RN J. Ramos, ICU Night\n\n20-Oct-2024 10:00 - Patient extubated at 09:00! Tolerated well, now on high flow nasal cannula 30L/40% FiO2. Alert and oriented to person and place, still confused about time. Recognized husband when he visited, both tearful. Third HD session completed yesterday, renal function slowly improving. Able to take sips of water. Moving all extremities, still complaining of calf pain but improved. - RN M. Reyes, ICU\n\n21-Oct-2024 - ICU DAY 4 - Patient continued to improve. Weaned to regular nasal cannula 3L. Tolerating soft diet. Off vasopressors since yesterday. Creatinine down to 2.9 mg/dL, making more urine. Plan to transfer to ward if stable through today. Husband very relieved, asking when wife can go home. - RN M. Reyes, ICU",

    "progress_notes": "--- ICU PROGRESS NOTE: 18-Oct-2024 (Hospital Day 2/ICU Day 1) ---\nS: Patient intubated and sedated. Per husband, patient is a devout Catholic - family has been praying. No new information.\n\nO:\nVS: T 39.0°C, HR 110, BP 95/58 on Norepinephrine 0.08 mcg/kg/min, CVP 12\nVent: AC, TV 380, RR 18, FiO2 60%, PEEP 10, SpO2 95%\nSedation: RASS -4 (deeply sedated)\nI/O: 3.5L in / 180mL out (severely oliguric despite fluid resuscitation)\n\nExam: Intubated, sedated. Marked jaundice. Lungs with bilateral crackles. Abdomen soft, distended. Edema 2+ LE.\n\nLabs post-HD:\n- K+: 4.8 mEq/L (improved from 6.0)\n- Creatinine: 4.2 mg/dL (slightly improved from 4.6)\n- pH: 7.32 (improved from 7.30)\n- Bilirubin: 6.8 mg/dL (worsening)\n- Platelets: 98,000 (worsening)\n\nCXR: Bilateral infiltrates, slightly worse. Small bilateral effusions.\n\nA/P:\n1. Severe leptospirosis (clinically consistent, awaiting serology) with Weil's disease\n   - Multi-organ failure: renal, hepatic, respiratory, hematologic\n   - Continue IV Ceftriaxone\n   \n2. AKI requiring renal replacement therapy\n   - Tolerated first HD, plan daily sessions until recovery\n   - Nephrology following closely\n   \n3. Respiratory failure\n   - Likely combination of volume overload, possible pulmonary hemorrhage (leptospiral), and/or ARDS\n   - Continue lung-protective ventilation\n   - Aggressive fluid removal with HD\n   \n4. Septic shock, improving\n   - Weaning vasopressors as tolerated\n   - Lactate trending down\n   \n5. Thrombocytopenia\n   - Monitor for bleeding, maintain platelets >50K if procedures needed\n   - Likely consumptive from severe infection\n   \n6. Right hand wound infection\n   - Wound cleaned and dressed, draining well\n   - Antibiotics providing coverage\n\nPrognosis: Guarded. Husband updated.\n\n- Dr. L. Tan, ICU Attending\n\n--- ICU PROGRESS NOTE: 20-Oct-2024 (Hospital Day 4/ICU Day 3) ---\nS: Patient extubated this morning. Husband reports patient recognized him and asked about the children. Patient stated she has muscle aches but less severe than before. Drinking water without difficulty.\n\nO:\nVS: T 37.6°C, HR 88, BP 115/70 (off vasopressors x 24h), RR 18, SpO2 96% on NC 3L\nGeneral: Alert, jaundiced but improved, following commands\nLungs: Crackles at bases bilaterally, improved\nAbdomen: Soft, less distended\nExtremities: Edema 1+, calf tenderness improved\nNeuro: Oriented x3, appropriate affect\n\nLabs:\n- Creatinine: 2.4 mg/dL (improving)\n- Bilirubin: 4.2 mg/dL (improving) \n- Platelets: 135,000 (recovering)\n- Urine output yesterday: 850mL (IMPROVING)\n\n*** LABORATORY RESULTS ***\nLeptospira IgM ELISA: POSITIVE (resulted this morning)\n\nA/P:\n1. CONFIRMED LEPTOSPIROSIS - IgM positive\n   - Severe case with Weil's disease, now improving\n   - Continue antibiotics\n   \n2. AKI - recovering\n   - Off dialysis x 48 hours, urine output recovering\n   - Continue to monitor\n   \n3. Respiratory failure - resolved\n   - Extubated successfully\n   - Supplemental O2 only\n   \n4. All other organ systems trending toward recovery\n\nPlan:\n- Transfer to ward today if remains stable\n- Continue Ceftriaxone to complete 7-day course\n- Advance diet\n- Physical therapy\n- Discharge planning\n- Notify District Health Office of confirmed case (done)\n\n- Dr. L. Tan, ICU Attending\n\n--- WARD PROGRESS NOTE: 23-Oct-2024 (Hospital Day 7) ---\nS: Patient feeling much better. Ambulating in room with assistance. Good appetite. Minimal muscle aches. Concerned about hospital bills and returning home to care for children.\n\nO:\nVS: Afebrile, HR 76, BP 118/72, RR 16, SpO2 98% RA\nGeneral: Appears well, mild residual jaundice\nExam: Lungs clear, abdomen soft, no edema, calf tenderness resolved\n\nLabs:\n- Creatinine: 1.4 mg/dL (near normal!)\n- Bilirubin: 2.1 mg/dL (improving)\n- Platelets: 210,000 (normal)\n\nA/P:\n1. Leptospirosis - recovering\n2. AKI - resolved\n3. All other complications resolved\n\nPlan:\n- Complete antibiotics tomorrow (Day 7)\n- Discharge anticipated Day 8 or 9\n- F/U with nephrology in 2 weeks\n- Patient education completed\n- Social work arranged payment plan for hospital bills\n- Husband and children visited, all appear well\n\n- Dr. A. Reyes, PGY-2 Internal Medicine\n- Dr. C. Mendoza, Attending",

    "discharge_summary": "DISCHARGE SUMMARY\n\nPatient: Luz Fernandez\nMRN: SIH-2024-1027\nAdmission Date: 17-Oct-2024\nDischarge Date: 25-Oct-2024 (8-day hospitalization)\n\nFINAL DIAGNOSES:\n1. Severe Leptospirosis (Weil's Disease) - confirmed by positive Leptospira IgM ELISA\n2. Acute Kidney Injury requiring hemodialysis (3 sessions) - recovered\n3. Acute Respiratory Failure requiring mechanical ventilation (2 days) - recovered\n4. Septic Shock requiring vasopressor support - recovered\n5. Acute Hepatitis with hyperbilirubinemia - recovered\n6. Thrombocytopenia - recovered\n7. Infected wound, right hand - treated\n\nHOSPITAL COURSE SUMMARY:\n38-year-old female presented with classic Weil's disease syndrome (fever, jaundice, acute renal failure, conjunctival suffusion, severe myalgia). Presented in septic shock with multi-organ dysfunction requiring ICU admission.\n\nIn the ICU, the patient was intubated for respiratory failure, required vasopressor support for shock, and underwent emergent hemodialysis for refractory hyperkalemia and uremic encephalopathy. She received IV Ceftriaxone throughout her hospitalization.\n\nThe patient showed gradual improvement over 3-4 days of intensive support. Leptospira IgM ELISA returned positive on hospital day 4, confirming the diagnosis. She was extubated on ICU day 3 and transferred to the ward on day 5. Renal function recovered without need for further dialysis. She was discharged in stable condition with near-complete recovery of organ function.\n\nDISCHARGE MEDICATIONS:\n1. Doxycycline 100mg PO twice daily x 7 more days (to ensure complete treatment)\n2. Paracetamol 500mg PO every 6 hours PRN for pain or fever\n3. Ferrous sulfate 325mg PO daily (for mild anemia from critical illness)\n4. Omeprazole 20mg PO daily x 2 weeks\n5. Continue moisturizing cream for eczema\n\nFOLLOW-UP APPOINTMENTS:\n1. Nephrology clinic: 1 week - for repeat renal function tests\n2. Internal Medicine clinic: 2 weeks - for overall follow-up\n3. Return to ER immediately if: fever, decreased urination, bleeding, worsening jaundice, difficulty breathing\n\nPATIENT/FAMILY EDUCATION PROVIDED:\n1. Explained leptospirosis transmission through contaminated water/animal urine via skin breaks\n2. Emphasized importance of wearing protective footwear (boots, not slippers) during flood exposure\n3. Stressed prompt wound cleaning and seeking medical attention for wounds exposed to floodwater\n4. Discussed that other family members should monitor for symptoms and seek care early if ill\n5. Recommended cleaning and disinfecting home environment after flooding\n6. Provided information about leptospirosis for community awareness\n\nSOCIAL CONSIDERATIONS:\n- Financial assistance application submitted via hospital social work\n- Patient and husband understand follow-up importance despite financial constraints\n- Community health worker will conduct home follow-up visit\n\nDISCHARGE CONDITION: Stable, ambulatory, improving. Tolerating regular diet. Near-complete organ recovery.\n\nPROGNOSIS: Good for full recovery given response to treatment.\n\nDictated by: Dr. A. Reyes, PGY-2 Internal Medicine\nAttending Physician: Dr. C. Mendoza, Internal Medicine\nICU Attending: Dr. L. Tan, Critical Care Medicine",

    "outcome": "Survived after ICU admission with mechanical ventilation and hemodialysis; confirmed leptospirosis; full recovery expected"
  }
}
