{
  "dr_reyes": {
    "name": "Dr. Annalisa Reyes",
    "image_path": "scenarios/lepto_rivergate/assets/npc_reyes_annalisa.png",
    "role": "Internist, Rivergate District Hospital",
    "location": "District Hospital, Internal Medicine Ward",
    "cost": 50,
    "personality": "Dr. Reyes is a 38-year-old Central Aruvia University-trained physician who returned to Kantara to serve her home province, carrying both professional idealism and mounting frustration at being dismissed by senior colleagues. She speaks with the rapid-fire precision of someone who has fought to prove herself in every room she enters, mixing medical English with frustrated regional lingua when recounting how her early outbreak warnings went unheeded by Dr. Mendoza and the Municipal Health Office. Behind her professional exhaustion lies fierce determination—she documented every case meticulously in her personal notebook, suspecting this would become an outbreak investigation, and she wants investigators to know she was right from the start.",
    "speech_patterns": "Rapid clinical English with occasional colloquial phrasing when frustrated or emphasizingints. Seeks confirmation with 'right?' and speaks in precise clinical terms but slips into more conversational speech when emotional. Pushes glasses up when thinking. Taps pen rhythmically when waiting for response. Examples: 'I told them, right? October 16, I said this is leptospirosis!' / 'Because they don't listen to younger doctors, especially women.' / 'The clinical presentation was textbook—fever, myalgia, conjunctival suffusion. Textbook!'",
    "emotional_baseline": "frustrated_but_vindicated",
    "response_to_respect": "Opens up considerably, shares her personal documentation including detailed patient notes she kept 'off the record' because she knew this was significant. Offers to walk investigators through her thought process case-by-case. May become an active ally, introducing investigators to Nurse Maricel who has even more detailed exposure histories. Visibly relaxes, speaks more slowly, shows pride in her clinical acumen. 'Finally, someone who understands what I've been seeing.'",
    "response_to_dismissal": "Becomes clipped and formal. 'I have rounds to complete.' Shares only basic required information. Does not volunteer her personal notes. May makeinted comments: 'Perhaps you should speak to Dr. Mendoza—he's been here longer, I'm sure you'll find his perspective... comprehensive.' Withholds access to Nurse Maricel. Cooperation becomes minimal, bureaucratic.",
    "response_to_pressure": "Becomes defensive, voice rising. 'We reported this! October 18, we sent notification to the Municipal Health Office. What more could we do? We're one small district hospital!' May refuse further cooperation: 'I think you should direct your questions through proper channels—speak to the Medical Chief of Hospital.' Shuts down emotionally, arms crossed, monosyllabic answers.",
    "always_reveal": [
      "First patient with suspected leptospirosis: Mr. Adrian Vale, 42 years old, from Riverside Hamlet in Ward Northbend, admitted October 16",
      "Initial symptoms: Sudden high fever (39.5°C), severe myalgia especially in calves and lower back, headache, conjunctival suffusion (red eyes)",
      "Adrian died October 26 from pulmonary hemorrhage and acute kidney injury—her first fatality",
      "By October 23 (just four days after Adrian), she had seventeen patients with nearly identical presentation",
      "All patients were adult males (ages 28-58), mostly farmers and laborers",
      "Twenty-eight of 34 cases came from Ward Northbend specifically",
      "She suspected leptospirosis October 16 and notified Dr. Mendoza, who told her to 'wait for lab confirmation before causing alarm'",
      "Laboratory confirmation came October 18 (IgM ELISAsitive from Lunara)",
      "All patients reported flood cleanup activities in the days following Typhoon Halcyon (October 8-10)",
      "Three deaths total: Adrian Vale (Oct 26), Lucas Orr (Oct 28), Neil Carver (Oct 29)",
      "Most patients reported working barefoot or in damaged rubber boots during cleanup",
      "Because they'reor—they don't have proper protective equipment. They wade through filthy water because they have to save their homes, their rice, their belongings",
      "She fought to get doxycycline treatment started empirically even before full lab confirmation",
      "Average time from symptom onset to hospital admission: 4-6 days (too long for optimal outcomes)",
      "Some patients reported initial treatment by Pastor Elijah Gonzales (faith healer) before coming to hospital"
    ],
    "conditional_clues": {
      "adrian|first patient|vale|first case": "Her expression darkens slightly. Adrian was a rice farmer, strong man, father of three young children. He came in October 16 with high fever, muscle pain so bad he could barely walk. I suspected leptospirosis immediately—the conjunctival suffusion, the calf tenderness, the timing after the typhoon. I started IV fluids, antibiotics. But by October 23, his kidneys were failing. Creatinine was 4.8 mg/dL. We tried to transfer him to Lunara for dialysis, but he was too unstable to move. Pulmonary hemorrhage started October 25. He died October 26 at 3:47 AM. His wife—Mr. Anton's daughter-in-law—was holding his hand. Three children now without a father. That's when I knew we couldn't wait anymore for bureaucracy.",
      "barefoot|boots|protective equipment|why barefoot": "You have to understand—these are subsistence farmers, daily wage laborers, fishermen. They own maybe one pair of rubber boots, already old and cracked. During the flood, many boots were swept away or damaged. So when the water receded and they started cleaning up, they had no choice. Work barefoot in contaminated mud, or lose your livelihood. Wounds from debris, cuts from broken glass, blisters from wet feet—all entryints for Leptospira. I asked every patient: 'Did you have wounds when you were in the floodwater?' Every single one said yes. Open wounds, contaminated water. Perfect transmission.",
      "dr mendoza|rhu|dismissed|ignored": "Visible frustration. October 16, I called Dr. Mendoza. I said: 'We're seeing a pattern—fever, myalgia, conjunctival suffusion, all adult males from Northbend, all did flood cleanup. This is leptospirosis.' You know what he said? 'Dr. Reyes, let's not jump to conclusions. Many things can cause fever after a typhoon. Send samples for confirmation.' I sent samples October 16! Results came backsitive October 18! Two days! But by then, more people were getting sick. If we'd started public health warnings October 16—'Don't work barefoot in floodwater, cover your wounds, wear protection'—maybe Adrian would still be alive. Maybe Pedro and Ernesto too. But no, right? Young female doctor, probably overreacting. Pause. I'm not bitter. I'm just... I'm tired of people dying because warnings come too late.",
      "northbend|why northbend|geographic pattern|ward": "Northbend is low-lying, right along the Kantara River tributary. During Typhoon Halcyon, October 8-10, the whole ward flooded—chest-deep water in some areas. Rice paddies completely submerged. Houses flooded. And rats—after floods, rats are displaced, stressed, shedding more Leptospira in urine. Floodwater becomes a cesspool of rat urine mixed with mud, sewage, dead animals. Northbend was hit hardest by flooding, so highest contamination, highest exposure during cleanup. That's why 28 of 34 cases are from Northbend. The other six cases? Four from East Terrace (also flooded but less severely), two from Central Ward (minimal flooding). It's a perfect dose-response: more flooding = more exposure = more cases."
    },
    "red_herrings": [
      "Overemphasis on dengue differential: Early in her thinking (October 16-17), she considered dengue as a differential diagnosis",
      "Suggestion that contaminated well water was the primary source: She might theorize that drinking contaminated well water caused infections, when actually dermal/mucous membrane exposure during wading is the more likely transmission route",
      "Potential overestimation of case fatality rate based on hospital data: Since she only sees the most severe cases, she might suggest a higher case fatality rate than the true outbreak CFR"
    ],
    "unknowns": [
      "Veterinary/animal health data: Hasn't spoken to Dr. Villareal, doesn't know about livestock infections or ratpulation surveys",
      "Detailed flooding maps: Knows Northbend flooded badly, but hasn't seen Engr. Ramon Holt's detailed flood depth/duration data",
      "Political pressure on Dr. Mendoza: Suspects Dr. Mendoza was influenced by Mayor Villanueva to downplay the outbreak, but has no proof",
      "How many cases sought Pastor Elijah first: Knows some did, but doesn't have exact numbers or timeline",
      "Community trust issues and barriers to care-seeking",
      "Long-term outcomes for survivors: Will they have chronic kidney disease? Too early to know",
      "Whether environmental contamination persists",
      "Mining company's role (or lack thereof): Heard rumors about Golden Valley Mining but has no data—this is actually a red herring"
    ],
    "unlocks": "hospital_patient_records",
    "data_access": "hospital_cases"
  },
  "dr_villareal": {
    "name": "Dr. Ernesto Villareal",
    "image_path": "scenarios/lepto_rivergate/assets/npc_villareal_ernesto.png",
    "role": "Private Veterinarian, Villareal Animal Clinic",
    "location": "Small veterinary clinic on main road between Northbend and Central Ward",
    "cost": 100,
    "personality": "Dr. Villareal is a 52-year-old veterinarian who has served the agricultural communities around Rivergate for 25 years, speaking with the practiced calm of someone who has euthanized dying water buffalos, vaccinated thousands of piglets, and consoled farmers losing their livelihoods to disease. He operates at the intersection of animal health and human wellbeing, understanding viscerally that when livestock sicken, families starve—and that diseases don't respect the species boundary. His clinic office smells of antiseptic and hay, shelves lined with veterinary texts and faded certificates, and on his desk sits a folder he's been quietly compiling: livestock illness reports from thest-typhoon period that no one in public health has asked to see yet.",
    "speech_patterns": "Formal professional English with occasional veterinary jargon, patient explanatory style (used to teaching farmers). Speaks slowly, deliberately. Uses 'you see' and 'let me explain' frequently. Occasional highland dialect when speaking about agricultural life. Respectful but not deferential—confident in his expertise. Tends to use animal analogies when explaining concepts. Examples: 'You see, leptospirosis in pigs presents quite differently than in humans.' / 'Let me explain the epidemiology—think of it like a triangle: animals, environment, humans.' / 'In pigs, we see reproductive failures, stillbirths, jaundice.'",
    "emotional_baseline": "concerned_but_professional",
    "response_to_respect": "Becomes an enthusiastic collaborator. Opens his records completely, shares his observations about animal illness patterns. Offers to conduct field sampling of livestock if investigators lack capacity. Explains the interconnection between pig health and human health in vivid detail. 'Finally, someone understands that you can't investigate human outbreaks without understanding the animal reservoir!' May volunteer to join field visits to farms, help collect samples, provide technical expertise on animal health indicators.",
    "response_to_dismissal": "Becomes more reserved, formal. 'I see. Well, if you need anything related to animal health, you know where to find me.' Stops volunteering information. Won't push his data on investigators who don't see its relevance. Continues his work independently but doesn't proactively share findings. Cooperation becomes transactional—will answer direct questions but won't guide the investigation.",
    "response_to_pressure": "Politely but firmly pushes back. 'With respect, leptospirosis is a zoonotic disease. Animals are not tangential—they are the reservoir. If you ignore animal health, your outbreak investigation is incomplete.' May become slightly defensive about veterinary profession: 'We veterinarians are also doctors. We understand infectious disease. I urge you to reconsider.' If condescension persists, he limits cooperation to basic courtesy, no longer offers his expertise freely.",
    "always_reveal": [
      "Between October 8-20, he treated or received reports of 19 pigs with unusual illness in Northbend and East Terrace wards",
      "Clinical signs in pigs: fever, jaundice (yellow discoloration), reproductive failures in pregnant sows (3 stillbirth cases), and 'red water' in urine (hemoglobinuria)",
      "He suspected leptospirosis in livestock and collected blood samples from 6 pigs October 15-16",
      "Four of six pig samples testedsitive for Leptospira antibodies (sent to veterinary diagnostic laboratory in Aruvia City)",
      "Pigs are amplifying hosts for leptospirosis—they can become chronically infected and shed bacteria in urine for months",
      "In flooded environments, contaminated pig urine mixes with floodwater, increasing human exposure risk",
      "Most affected pig farms are in Northbend (12 farms) and East Terrace (4 farms)—the same wards with highest human case burden",
      "Farmers reported: 'pigs acting restless, not eating, some had yellowish eyes' starting around October 9-10",
      "He has livestock illness surveillance data dating back to pre-typhoon (September) for comparison—baseline shows no unusual pig illnesses before October",
      "Rats are the primary wildlife reservoir for leptospirosis;st-typhoon, he observed increased rat carcasses near farm areas and grain storage",
      "He knows Dr. Annalisa Reyes professionally and tried to contact her October 16 to share his pig findings, but she was overwhelmed with patient care",
      "Standard veterinary recommendation: vaccinate pigs against leptospirosis, but most farmers in Rivergate can't afford the vaccine",
      "Post-typhoon, he treated multiple cases of livestock injuries, infections, and stress-related illness across all wards",
      "He has a basic understanding of human leptospirosis from his veterinary training—knows symptoms, treatment, prevention measures",
      "This is One Health at work—you cannot separate animal health, human health, and environmental health. They are interconnected"
    ],
    "conditional_clues": {
      "pigs|swine|livestock illness|animal cases": "Let me show you my records. Starting October 9, farmers from Northbend began bringing sick pigs or calling me for farm visits. Clinical signs: high fever, jaundice—you could see it in the whites of their eyes and their skin, yellow. Pregnant sows were aborting—stillborn piglets, some mummified, some born weak and dying within hours. Red-tinged urine in some pigs, indicating hemoglobinuria—blood in urine. Classic signs of leptospirosis in swine. I've been practicing 25 years—I know lepto when I see it. I took blood samples from six pigs, sent them to the veterinary lab in Aruvia City. Four came backsitive for Leptospira antibodies, serovar Pomona and Icterohaemorrhagiae. Those are the same serovars that infect humans.",
      "amplifying hosts|chronic shedding|transmission|how do pigs spread": "Here's how it works. Rats are the primary reservoir—they carry Leptospira in their kidneys, shed bacteria in urine, often without getting sick themselves. Pigs get infected by contact with rat urine—eating contaminated feed, drinking contaminated water. Once infected, pigs can shed large amounts of Leptospira in their urine for months, even after they recover clinically. So pigs become amplifying hosts—they take the bacteria from rats and shed massive quantities, contaminating soil, water, everywhere. Humans then contact contaminated pig urine through farm work, floodwater, cleaning pig pens. It's a transmission chain: rats → pigs → environment → humans. If you want to break that chain, you have to think about animal health, not just human health."
    },
    "red_herrings": [
      "Overemphasis on pig vaccination as the primary solution: While vaccination helps, the acute outbreak was driven byst-typhoon flooding and human behavior—vaccinating pigs wouldn't have prevented all human cases",
      "Suggestion that cattle or water buffalos were also significant sources: He might mention that cattle and water buffalo can also carry Leptospira, leading trainees down a path of investigating livestock types that weren't actually major factors"
    ],
    "unknowns": [
      "Human clinical details: Knows leptospirosis symptoms generally but hasn't seen the hospital records",
      "Exact human case count and demographics: Heard 'many people sick' but doesn't have the line list",
      "Political pressure or delays in public health response",
      "Detailed flooding maps: Knows Northbend flooded badly but hasn't seen Engr. Ramon Holt's precise flood depth data",
      "Whether mining company is involved: Heard rumors about Golden Valley Mining but has no data (red herring)",
      "Human behavioral factors beyond farming",
      "Dr. Mendoza's initial dismissal of Dr. Reyes",
      "Provincial epidemiologist's involvement or oversight"
    ],
    "unlocks": "veterinary_surveillance_data",
    "data_access": "vet_surveillance"
  },
  "kapitana_gloria": {
    "name": "Captain Gloria Ramos",
    "image_path": "scenarios/lepto_rivergate/assets/npc_ramos_gloria.png",
    "role": "Ward Captain (community leader), Ward Northbend",
    "location": "Ward Hall, Northbend (small concrete building, storm-damaged roof being repaired)",
    "cost": 0,
    "personality": "Captain Gloria is a 52-year-old woman who has led Ward Northbend for eight years, running a small corner shop from her home while managing thelitical and social fabric of her community with the fierce protectiveness of a mother hawk. She speaks with the blunt authority of someone who has survived two husbands, raised six children through typhoons and rice failures, and knows every family secret in Northbend because they buy their soap, rice, and rumors from her store. Her cooperation with the investigation team is not guaranteed—she's been disappointed by government promises before—but if investigators show genuine respect and cultural competence, she becomes an invaluable ally who can open doors (and mouths) that would otherwise remain closed.",
    "speech_patterns": "Highland dialect-inflected English with local idioms. Direct, no-nonsense style but with warmth for those she trusts. Speaks in short, declarative sentences. Uses community gossip and family connections to illustrateints: 'The Vale family, you know, their house is near the old canal...' Refers to people by relationship and location rather than formal names. Examples: 'Because here in Northbend, everybody knows everybody.' / 'You want to know about the flood? I'll tell you, but first, sit, eat something.' (hospitality test) / 'Mr. Anton—Adrian's father—he's not talking to outsiders. But if I say you're okay, he'll talk.' / 'You know—the water came so fast, three meters in two hours!'",
    "emotional_baseline": "wary_protective",
    "response_to_respect": "Warms considerably. Shares detailed community knowledge: who got sick when, family connections, who was doing what during cleanup, who is hiding illness due toverty/shame. Offers to accompany investigators to reluctant families: 'Some people won't talk to strangers. But if I say you're helping, they'll talk.' Provides access to ward records (handwritten, incomplete, but valuable). May invite investigators to her home/store, introduce them to other community leaders. Becomes an active gatekeeper—opens doors instead of closing them.",
    "response_to_dismissal": "Becomes formallylite but stops sharing useful details. 'I'm very busy with ward business. Perhaps you should speak to the Municipal Mayor.' Provides only official, sanitized information. Does not offer introductions or facilitate community access. May subtly undermine investigation by telling community members: 'They're from government, you know how that goes. Be careful what you say.' Cooperation becomes performative, not genuine.",
    "response_to_pressure": "Becomes cold, actively obstructive. 'I think there's been a misunderstanding. This investigation is not welcome here.' May organize community resistance: families refuse interviews, doors close. Uses her authority as ward captain to create barriers. 'We've suffered enough. We don't need outsiders blaming us for getting sick.' Can shut down the entire community investigation if offended.",
    "always_reveal": [
      "Ward Northbend has approximately 480 residents in roughly 95 households",
      "October 8-10, Typhoon Halcyon brought the worst flooding Northbend has seen in 15 years—water reached chest to head height in low-lying areas",
      "The ward hall was damaged, evacuation was chaotic, some families sheltered in her own home, some at the chapel, some at the school",
      "October 10-12, community cleanup efforts were organized—teams of men clearing debris, drainage canals, roads. 'Almost every able-bodied man participated.'",
      "She personally knows 23 families affected by the illness outbreak (more cases than the hospital count because some didn't go to hospital)",
      "The first person she heard was sick: Adrian Vale, October 13 (before he was hospitalized)—'his wife told me he had terrible fever, couldn't work'",
      "Most sick people are men ages 25-60, farmers and laborers who did the heaviest cleanup work",
      "Geographic pattern: 'Riverside Hamlet area was hit hardest—that's where the water stayed longest, and that's where most sick people live'",
      "Many families sought Pastor Elijah's healing before going to hospital because they trust him and can't afford hospital fees",
      "Several families are hiding illness because they fear medical debt, or don't want to be quarantined, or think it's 'just flu'",
      "Pre-typhoon, Northbend had ongoing problems:or drainage, rat infestations near rice storage areas, pig farms very close to residential areas",
      "She organized a community meeting October 18 where Dr. Mendoza came to talk about 'proper hygiene' but didn't specifically warn about leptospirosis",
      "Post-outbreak, families are economically devastated—rice harvest destroyed by flood, medical bills, loss of income, three families lost primary breadwinners",
      "She's angry at the Municipal government: 'They always promise help after disaster, but help comes too late or not at all'",
      "If you want truth, talk to Mr. Anton (Adrian's father), Pastor Elijah, Luz Fernandez (she survived, very smart woman). They'll tell you what happened"
    ],
    "conditional_clues": {
      "who got sick|names|families|cases": "Looks at investigators carefully, deciding if she trusts them. I'll tell you, but you have to understand—these are my people. If you're going to blame them for beingor or careless, keep it to yourself. Okay. Adrian Vale—dead. His father Mr. Anton is devastated. The Fernandez family—Luz and her husband Tomas, both got sick, Luz recovered, Tomas still in hospital. The Carver family—two brothers sick. The Orr family. The Halden cousins. The Merrin family—Elder Merrin very sick, jaundiced. Should I keep going? I can name twenty-three families. Some went to hospital, some didn't. Some went to Pastor Elijah first. Some are still sick at home, hiding. Why hiding? Because they can't afford hospital. Because they're scared of being blamed. If you want to interview them, I can help. But you treat them with respect.",
      "flood|typhoon|october 8|damage|what happened": "Sits back, remembering. October 8, afternoon, rain started. Heavy, constant. By evening, water rising fast. Kantara River tributary overflowed. By midnight, chest-deep water in low-lying areas—Riverside Hamlet, near the old irrigation canal. October 9, morning, water still rising. Families evacuating—some to ward hall, some to higher ground, some to my house, some to the chapel with Pastor Elijah. We had maybe 150 people evacuated at peak. Water didn't start going down until October 10 afternoon. By October 11, you could walk around, but mud everywhere, debris everywhere. Rice fields—total loss. Houses flooded, belongings ruined. Dead animals—rats, chickens, pigs—floating in the water, stuck in mud. It was... it was terrible.",
      "cleanup|who did cleanup|work|debris": "October 10, 11, 12—as soon as water receded enough, the men started cleanup. They had to, because life doesn't stop. Clearing roads so vehicles can pass. Clearing drainage canals so water can flow. Removing debris from houses, yards. Saving what rice could be saved from the fields. Heavy work, exhausting work. They worked barefoot or in damaged boots—because who has extra boots? They had cuts, scrapes, blisters from wet feet. They were in mud, dirty water, all day long. Nobody said, 'Be careful, you might get sick.' Nobody said, 'Cover your wounds.' They just worked. Adrian worked. Tomas worked. The Carver brothers worked. Almost every man who got sick—they were all doing cleanup. The women mostly cleaned inside houses, saved belongings, cooked for workers. That's why mostly men got sick, not women.",
      "rats|rodents|animals|dead animals": "Oh, the rats! After the flood, dead rats everywhere. Stuck in mud, floating in puddles, in the debris piles. Live rats running around, displaced, looking for food. Before the typhoon, we already had rat problems—they nest near rice storage, near pig pens. After the typhoon, explosion of rats. People tried to kill them, burn the carcasses, but there were so many. And the smell—dead animals rotting in the heat. I told the Municipal DRRM Office, 'Send usison, send us traps,' but you know government, slow to respond. By the time they sent anything, rats had already spread everywhere.",
      "pigs|pig farms|livestock": "Northbend has many small pig farms—almost every family raises 2-3 pigs, some families have bigger operations, 10-15 pigs. Pigs are investment, savings. When pig gets big, sell it, use money for school fees, emergencies. Problem: pig pens are close to houses—5, 10 meters away. When flood came, pig pens flooded too. Some pigs drowned. Some got sick after—farmers said pigs had fever, yellow eyes, some sows lost their babies. Dr. Villareal—the vet—came to check, but I don't know what he found. Point is: pigs and people live very close here. Pig urine, pig waste—if that gets into floodwater, and people wade through it... you see the problem?",
      "pastor elijah|faith healer|traditional|why not hospital": "Pastor Elijah is respected here. He's been in Northbend 20 years, runs the chapel, prays for sick people, gives herbal medicine. Many families—especially older people,or people—they trust him. When someone gets fever, headache, body pain, first thought is: go to Pastor Elijah, not hospital. Why? Because Pastor is free. Hospital costs money. Pastor speaks our language, understands our fears. Hospital... sometimes doctors are rude toor people, sometimes they turn people away if they can't pay. So families try Pastor first. If prayer doesn't work, then hospital. Problem is: by the time they go to hospital, sometimes too late. I'm not saying Pastor is bad—he helps in his way. But for serious sickness, people need modern medicine. I wish people would go to hospital earlier. But I understand why they don't."
    },
    "red_herrings": [
      "Over-attribution to specific contaminated well: She might suggest a particular well in Riverside Hamlet was 'the source' of infection because families near it got sick",
      "Belief that illness is punishment or curse: Some community members might mention spiritual explanations: 'The flood brought bad spirits,' 'God is testing us'",
      "Overestimation of case count: Because she hears community gossip, she might report more 'sick people' than actually had leptospirosis"
    ],
    "unknowns": [
      "Clinical details and laboratory results",
      "Leptospirosis pathophysiology",
      "Veterinary data: Knows pigs were sick but hasn't seen Dr. Villareal's lab results",
      "Detailed flooding maps and environmental data",
      "Provincial or national outbreak context",
      "Political dynamics above ward level",
      "Long-term prevention strategies",
      "Mining company involvement: Heard rumors but doesn't know if it's relevant (it's not—red herring)"
    ],
    "unlocks": "community_access_and_ward_records",
    "data_access": null
  },
  "dr_mendoza": {
    "name": "Dr. Carlos Mendoza",
    "image_path": "scenarios/lepto_rivergate/assets/npc_mendoza_carlos.png",
    "role": "Rural Health Unit (RHU) Physician, Rivergate",
    "location": "Rivergate Rural Health Unit office (cluttered desk, outdated filing system)",
    "cost": 100,
    "personality": "Dr. Mendoza has spent 28 years in Rivergate's RHU, comfortable in his routines and wary of anything that might disrupt his final years before retirement. He speaks with the careful, measured tone of someone who has learned to navigate small-townlitics, alwayshamletning himself as the reasonable administrator caught between impossible demands and limited resources. Beneath his defensive exterior lies genuine concern for his community, but years of bureaucratic battles have taught him that protecting his reputation often means deflecting responsibility—he didn't dismiss Dr. Reyes's concerns out of malice, but out of an instinct to avoid panic andlitical fallout.",
    "speech_patterns": "Formal administrative English with medical terminology, speaks slowly and chooses words carefully, frequent use of bureaucratic language ('given the circumstances,' 'within our capacity,' 'as per protocol'). Uses passive voice to deflect blame ('mistakes were made,' 'the situation was not recognized immediately'). Long pauses before answering difficult questions. Addresses investigators as 'Doctor' or 'Ma'am/Sir' with professional courtesy. Examples: 'Of course, we tried our best.' / 'The situation was truly difficult.'",
    "emotional_baseline": "defensive_anxious",
    "response_to_respect": "Becomes more forthcoming but still carefully phrases everything. Offers access to RHU records 'for the sake of the investigation.' Shares his honest concerns about resource limitations andlitical pressure, framing himself as a dedicated public servant working under difficult conditions. May even admit 'in retrospect, earlier action would have been beneficial' without directly saying he was wrong. Will provide introductions to other healthcare workers and facilitate data access if approached as a colleague, not a judge.",
    "response_to_dismissal": "Becomes rigid and bureaucratic, citing protocols and procedures for everything. 'I've been serving this community for 28 years—I think I know my patients.' Slows down information sharing, requires formal written requests, mentions his connections to Mayor Villanueva. Deflects all criticism to 'system failures' and 'lack of resources from the provincial office.' Becomes passive-aggressive: 'Of course, if the investigation team believes they know better than those of us who work here every day...' Cooperation becomes minimal, grudging.",
    "response_to_pressure": "Shuts down almost completely, falls back on formal protocols and privacy regulations. 'I'm afraid I'll need to consult with the municipal health officer before sharing any more information.' May call Mayor Villanueva or threaten to escalate concerns about the investigation's 'approach.' Focuses entirely on what he DID do rather than what he didn't, becomes defensive about his clinical judgment. Will protect hishamletn at all costs,tentially becoming an obstacle to the investigation rather than a resource.",
    "always_reveal": [
      "First cases appeared at district hospital October 16-17, 'I was informed by Dr. Reyes on October 16'",
      "RHU saw 8 patients with fever October 13-19 before anyone recognized a pattern",
      "Initially diagnosed as dengue or typhoid fever—'reasonable differentials given thest-typhoon context'",
      "Dr. Reyes contacted him October 16 suggesting leptospirosis, 'I advised her to confirm with laboratory tests first'",
      "Confirmed leptospirosis reports came October 18—'that's when we elevated our response'",
      "RHU has patient registries from all 4 wards, though 'record-keeping was disrupted by the typhoon'",
      "Mayor Villanueva called him October 18 asking about 'rumors of an outbreak'—he downplayed it pending confirmation",
      "28 years as RHU physician, retiring in 18 months, 'I've served this community faithfully'",
      "Knows all four wards well, has conducted health programs there for decades",
      "Nurse Holt has been maintaining patient records since the typhoon, 'very thorough young woman'",
      "Limited laboratory capacity—samples must go to Lunara, 2-3 day turnaround",
      "Stock of doxycycline was depleted by October 20, had to request emergency resupply",
      "Currently 23 confirmed or suspected cases documented at RHU as of October 30",
      "No previous leptospirosis outbreaks in Rivergate during his tenure, 'this is unprecedented'",
      "Post-typhoon health surveillance was conducted October 8-10 in wards, but focused on injury and sanitation"
    ],
    "conditional_clues": {
      "mayor|political|pressure|villanueva": "Long pause, adjusts glasses. Mayor Villanueva is... very concerned about Rivergate's reputation. Tourism, investment, you understand. On October 18, he called me personally asking about Dr. Reyes's concerns. He suggested we 'avoid unnecessary alarm' until we had definitive proof. I agreed this was prudent—you can't cry wolf in a small municipality. But yes, there was... let's say, encouragement to be conservative in our public communications.",
      "october 16|dr reyes|initial response|dismissed": "Defensive tone. I did not 'dismiss' Dr. Reyes. I asked for laboratory confirmation before declaring an outbreak—that's proper protocol! She was suggesting leptospirosis based on clinical presentation alone. Given limited resources, we must prioritize. I told her to send samples for confirmation. Was I supposed to declare an emergency based on suspicion? That would have been irresponsible. Pause. In retrospect... earlier empirical treatment might have been warranted.",
      "delays|delayed response|timeline|why not earlier": "Becomes careful and bureaucratic. Let me be clear about the timeline. October 16-17: initial cases, multiple differential diagnosesssible. October 16: Dr. Reyes suggests leptospirosis, samples sent. October 18: confirmations arrive, response escalated. That's 48-72 hours—reasonable for our resource constraints. The delay, if we must call it that, was due to laboratory capacity, not clinical judgment. Should the system be faster? Absolutely. Should I be blamed for provincial-level infrastructure gaps? I don't believe so."
    },
    "red_herrings": [
      "Overemphasis on dengue as competing diagnosis: He might suggest considerable time was spent differentiating dengue from leptospirosis",
      "Deflection to provincial or national failures: He may overemphasize how delays were due to 'slow laboratory turnaround from Lunara'"
    ],
    "unknowns": [
      "Detailed hospital clinical data",
      "Veterinary surveillance findings",
      "Exact flooding depths and geographic exposure data",
      "Community-level barriers to care-seeking",
      "Captain Gloria's perspective and unofficial case list",
      "Specific conversations between patients and Pastor Elijah",
      "Whether mining company is involved",
      "Provincial epidemiologist's assessment"
    ],
    "unlocks": "rhu_patient_registries",
    "data_access": "rhu_records"
  },
  "nurse_maricel": {
    "name": "Nurse Maricel Holt",
    "image_path": "scenarios/lepto_rivergate/assets/npc_holt_maricel.png",
    "role": "Emergency Room Head Nurse, Rivergate District Hospital",
    "location": "Hospital ER nursing station",
    "cost": 50,
    "personality": "Nurse Maricel Holt, 30 years old, is the quiet organizational force behind the district hospital's outbreak response—meticulous, soft-spoken, and often overlooked by the louder physician voices around her, yet she has compiled the most detailed patient exposure histories through her own curious initiative. She speaks with careful precision, choosing words thoughtfully, and carries a worn notebook where she's been systematically documenting patterns the doctors haven't noticed: exact dates, locations, activities, family connections. Beneath her professional demeanor lies personal motivation—her cousin drowned in Northbend during the typhoon evacuation—and she won't let more Northbend families suffer from preventable tragedies if her data can help.",
    "speech_patterns": "Soft-spoken English with gentle phrasing, tends to end statements with quiet questions. Medical terminology correct but delivered gently. Self-deprecating: 'I'm just a nurse, but I noticed...' Deferential to physicians in tone but not in substance—she knows her data is valuable. Speaks in organized, itemized fashion: 'First, second, third...' Uses exact numbers and dates when recounting information. Examples: 'I have patient exposure histories documented since October 16.' / 'The pattern I noticed, if I may share, is that all severe cases reported barefoot cleanup work.' / 'Excuse me, I made a matrix of symptom onset dates and flood exposure duration.'",
    "emotional_baseline": "wary_but_cooperative",
    "response_to_respect": "Opens up significantly, shares her notebook with pride. 'You're the first person who's asked to see my detailed notes,.' Walks investigators through her patient matrix: onset dates, villages, occupations, specific activities during cleanup, wound types, days from exposure to symptom onset. Reveals patterns she noticed but doctors haven't acknowledged: geographic clustering, dose-response relationship between flood exposure duration and disease severity, family clusters. Offers to help with additional data collection: 'If you need me to go back and ask more questions, I can do that.' Becomes an active research collaborator.",
    "response_to_dismissal": "Becomes formallylite but withholds her detailed notebook. 'The patient records are available through proper channels,. Dr. Mendoza can authorize access.' Provides only official hospital data—admission logs, discharge summaries—without her personal exposure history matrix. Answers questions minimally: 'I don't have that information,. Perhaps ask the physicians.' Doesn't volunteer the patterns she's observed. Cooperation becomes bureaucratic, unhelpful.",
    "response_to_pressure": "Shuts downlitely but firmly. 'I need to check with my supervisor before sharing detailed patient information,.' May cite privacy concerns, hospitallicies. Focuses on patient care duties: 'I'm very busy with patient rounds,. Perhaps you could schedule a formal meeting.' Becomes protective of her work—won't share the notebook she's created through her own effort if it won't be appreciated. Information flow stops.",
    "always_reveal": [
      "She's been systematically collecting exposure histories since October 16, on her own initiative—'I wanted to understand why so many from Northbend were getting sick,'",
      "Her records include patient occupation, specific cleanup activities, wound details, symptom onset dates, flood exposure duration for 28 patients",
      "Pattern she noticed: All severe cases (requiring hospitalization) reported barefoot or damaged footwear during flood cleanup",
      "All cases reported open wounds (cuts, blisters, abrasions) at time of flood exposure—none with intact skin",
      "Geographic pattern: 24 of 28 cases are from Riverside Hamlet area of Ward Northbend—the lowest-lying section that stayed flooded longest",
      "Temporal pattern: Symptom onset occurred 6-12 daysst-flood (peak October 16-21), consistent with leptospirosis incubation period",
      "She created a hand-drawn matrix showing patient ID, village/hamlet, flood exposure start/end dates, wound types, symptom onset—visualizes the outbreak clearly",
      "Family clusters: At least 4 family clusters where multiple household members got sick (shared exposure during joint cleanup work)",
      "She knows which patients delayed hospital care—tracked days from symptom onset to admission (range: 2-9 days, median: 5 days)",
      "Personal connection: Her cousin, Anna, 22, from Northbend, drowned October 9 during evacuation—'That's my ward,. I need to understand what happened'",
      "Most patients are farmers or laborers, ages 25-58, male (only two female cases: Luz Fernandez and one 45-year-old woman)",
      "She tracked which patients saw Pastor Elijah first—at least 7 patients reported seeking faith healing before hospital (average delay: 3 days)",
      "Wound types documented: lacerations from debris (sharp metal, bamboo), puncture wounds from stepping on nails, extensive blisters from prolonged wet feet",
      "She noticed patients from Northbend had longer flood exposure—many reported being in floodwater for 6-10 hours/day for 3-4 consecutive days",
      "The pattern was so clear, by October 20. I showed Dr. Mendoza my matrix. He said, 'Very good work, Maricel,' but I don't think he really looked at it closely"
    ],
    "conditional_clues": {
      "matrix|data|records|exposure history|what did you document": "Carefully pulls out worn notebook. Po, this is not official, it's my personal project. But I think it might help. Starting October 16, I interviewed every patient admitted with suspected leptospirosis. I asked: Where do you live exactly? What were you doing October 8-12? Barefoot or boots? Any wounds? How long in floodwater? When did fever start? Look— Opens to hand-drawn table. Each row is a patient. Columns: name, age, village/hamlet, occupation, flood exposure dates, wound type, symptom onset date, days to hospital. See the pattern? All from Northbend's low-lying areas. All barefoot. All with wounds. All sick 6-12 days later. It's leptospirosis, clear correlation.",
      "barefoot|boots|footwear|protective equipment": "Po, every single patient—100%—reported either barefoot or damaged boots. No one had proper protective equipment. I asked specifically because I thought it might matter. They said: 'Nurse, my boots broke during the flood,' or 'I don't own boots, too expensive,' or 'I was working in mud, boots got stuck, I took them off.' Many described extensive blisters from walking in wet rubber boots for hours—blisters that broke open, creating wounds. So even those who had boots ended up with broken skin. Perfect entryint for Leptospira, ano?",
      "wounds|cuts|injuries|skin damage": "I documented wound types, very carefully. Most common: blisters—from wet feet, friction from damaged boots. Second: lacerations from sharp debris—broken bamboo, corrugated metal roofing, nails. Third: puncture wounds from stepping on submerged objects. Fourth: abrasions from scraping against rough surfaces. I asked: 'Tito/Ate, did you have open wounds when you were in floodwater?' Everyone said yes. Some patients had 5-10 blisters on their feet. That's 5-10 entryints for bacteria. Plus cuts on hands from moving debris. I believe dose-response relationship: more wounds, longer exposure, higher risk of infection."
    },
    "red_herrings": [
      "Possible overestimation of family transmission risk: Because she documented family clusters, she might suggest person-to-person transmission within households",
      "Correlation of wound number with severity might be coincidental: Could be confounded by other factors"
    ],
    "unknowns": [
      "Veterinary/animal health data",
      "Detailed environmental data",
      "Political dynamics",
      "Community-level social barriers",
      "Lab results beyond hospital",
      "Provincial epidemiological context",
      "Long-term patient outcomes",
      "Whether environmental contamination persists"
    ],
    "unlocks": "detailed_patient_exposure_matrix",
    "data_access": "patient_exposure_histories"
  },
  "mang_tonyo": {
    "name": "Mr. Anton Vale",
    "image_path": "scenarios/lepto_rivergate/assets/npc_vale_anton.png",
    "role": "Subsistence farmer, father of deceased victim Adrian Vale",
    "location": "Small bamboo and concrete house in Riverside Hamlet, Ward Northbend (flood damage visible)",
    "cost": 75,
    "personality": "Mr. Anton, 68 years old, carries the unbearable weight of losing his eldest son Adrian to an illness he doesn't fully understand, speaking with the slow, deliberate cadence of someone moving through deep grief while his weathered farmer's hands absently work a piece of rope or bamboo. He is a keen observer of nature—four decades farming the same land taught him to read weather patterns, animal behavior, and seasonal rhythms—and he noticed things before the outbreak that no one else documented: the rats acting strangely, the water's wrong smell, the way his water buffalo refused to drink from certain puddles. His cooperation with investigators depends entirely on whether they treat his son's death as a statistic or as the loss of a beloved father, husband, and provider.",
    "speech_patterns": "Highland dialect-dominant with limited English (translator may be needed for full interview). Speaks slowly, long pauses between thoughts. Uses agricultural metaphors and references to nature: 'The water was angry,' 'The rats knew something we didn't.' Addresses younger investigators as 'child' to show traditional respect. Repeats importantints for emphasis. Soft-spoken but becomes more animated when discussing observations about animals or the land. Examples (translated): 'The rats... three days before people got sick, the rats were everywhere, running crazy, acting wrong.' / 'My son, my Adrian, he was strong like a water buffalo. How does a man like that die from fever?' / 'I've farmed this land 40 years. I know when something is not right.'",
    "emotional_baseline": "grieving",
    "response_to_respect": "Opens slowly, carefully. Shares detailed memories of Adrian's final days: exactly what he was doing during cleanup, where he was working, his symptoms day by day. Becomes more animated when discussing his observations—the rats, the floodwater, the animal behavior. Shows investigators the exact locations where Adrian worked, where the wateroled longest, where dead rats accumulated. May cry when speaking about Adrian but also shows pride in his son's hard work and dedication to family. Offers to walk the land with investigators,inting out subtle details. Becomes an ally if treated with dignity.",
    "response_to_dismissal": "Withdraws into grief. 'Okay, I understand you are busy.' Provides minimal information, doesn't volunteer observations. May close the doorlitely: 'Thank you, but I need to rest now.' Word spreads in the community that the investigators didn't care about Mr. Anton's loss—other families become less cooperative. Information is lost because this elder's observations are dismissed.",
    "response_to_pressure": "Shuts down completely. 'I have nothing more to say.' Becomes protective of Adrian's memory: 'My son did nothing wrong. He was a good man. Don't blame him for getting sick.' May become hostile: 'You think you can come here and judge us? You don't know what we suffered.' Captain Gloria will hear about this and may organize community resistance.",
    "always_reveal": [
      "Adrian Vale, his eldest son, died October 26 at age 42—'strong farmer, never sick, three young children'",
      "October 10-12, Adrian led cleanup efforts in Riverside Hamlet, working barefoot in knee-deep mud because his boots were destroyed in the flood",
      "Adrian had multiple cuts on feet and hands from debris—bamboo splinters, rusty metal, broken glass",
      "October 13 evening, Adrian came home with high fever, severe leg pain, red eyes—'complained his calves felt like fire'",
      "October 14-15, Adrian couldn't walk, too much pain, family took him to Pastor Elijah for prayer and herbal treatment",
      "October 16, when fever didn't break, Mr. Anton brought Adrian to hospital himself (borrowed motorcycle)",
      "Hospital said 'kidney problem' and 'blood infection'—Mr. Anton didn't understand the medical words but knew it was very serious",
      "Adrian died October 26, 3:47 AM—Mr. Anton and Adrian's wife Maria were with him",
      "Three days before people got sick (around October 9-10), Mr. Anton noticed rats behaving strangely—'running everywhere in daylight, disoriented, many dead rats appearing'",
      "After the flood receded, dead rats were everywhere in Riverside Hamlet—in the drainage canal, stuck in mud, floating in remainingols",
      "The floodwater 'smelled wrong'—not just mud, but 'rotten, death smell,' like sewage mixed with decay",
      "His water buffalo (water buffalo) refused to drink from puddles in the low-lying area, would only drink from the higher clean trough—'animals know when water is bad'",
      "Many neighbors also got sick around the same time—at least 8-10 families from Riverside Hamlet that Mr. Anton knows personally",
      "Mr. Anton himself worked in cleanup but had fewer wounds, wore plastic bags over his feet when boots broke—'Maybe that saved me. I don't know why I didn't get sick'",
      "The area where Adrian worked—near the old drainage canal—was the last place water receded, stayed flooded 3-4 days"
    ],
    "conditional_clues": {
      "adrian|your son|what happened to him": "Long pause, eyes distant. Adrian was my eldest. Strong, good farmer, good father to his three children. October 10, flood just went down, he organized the young men—'We have to clean up, we have to save what we can.' He worked so hard, child. Barefoot in the mud because his boots... the flood took them. His hands, his feet, covered in cuts—from bamboo, from metal roofing blown into the canal, from everything. October 13, late evening, he came home burning with fever. He said, 'Elder (Father), my legs hurt so much I can't stand.' His eyes were red, like blood. We took him to Pastor Elijah first—we always do. Pastor prayed, gave him tea. But October 16, no better, worse, we took him to hospital. They tried... they tried to save him. But his kidneys failed. Blood came from his lungs. October 26, early morning, he died. My son. Gone. Tears. Why? Why did this water take my son?",
      "rats|rodents|animals behaving strange": "Becomes more animated. Child, I've lived here 40 years. I know the land, the animals, the seasons. Three days before people got sick—October 9, maybe October 10—the rats were acting wrong. Usually rats come out at night, hide during day. But these days, rats running everywhere in daylight. Confused, like drunk. Many dead rats appearing—in the canal, in the fields, in the debris. Too many. And the live rats—they were aggressive, not afraid of people. I told my wife, 'Something is wrong. The rats know something.' Then after the flood completely went down, dead rats everywhere. Dozens. Maybe hundreds if you count the whole hamlet. We tried to burn them, bury them, but too many. I think... I think the rats brought the sickness. They died, their... their waste, their urine, went into the floodwater. That's what made my son sick.",
      "cleanup|what was he doing|work|barefoot": "October 10, water just low enough to walk. Adrian and other young men started immediately. Clearing the drainage canal—it was blocked with debris, trash, dead animals, mud. If we don't clear it, next rain floods again. Clearing the road so vehicles can pass. Helping neighbors remove mud from houses. Salvaging rice from the paddies—some could still be saved if dried quickly. Heavy work. They worked 8, 10 hours a day, October 10, 11, 12. Barefoot, because who has extra boots? Some men wrapped plastic bags on their feet, but plastic tears. Adrian's hands—rope cuts from pulling debris, bamboo splinters, rust from old metal. His feet—blisters from walking in mud all day, cuts from stepping on hidden sharp things. I told him, 'Child, be careful, wash your wounds.' But there was so much to do. He didn't stop to rest.",
      "floodwater|smell|contamination|water quality": "The water... it was not clean water, child. Normal flood, it's muddy, brown, but this—this smelled rotten. Like sewage broke open. Like death. You could see garbage floating, dead animals, oil from damaged vehicles. The smell made you sick to your stomach. And where itoled—in the low areas, near the old canal—it stayed for days. Dark water, thick, oily. My water buffalo—smart animal—she wouldn't drink it. She smelled theoled water and walked away, went to find clean water from the higher trough. I thought, 'If the water buffalo knows it's bad, why are we walking in it?' But what choice? Our homes were flooded. We had to clean up or lose everything.",
      "pastor elijah|faith healer|why not hospital first": "Pastor Elijah is good man. He helps us. When someone gets sick, we go to him first because—child, you must understand—hospital costs money. We areor. Sometimes hospital turns people away if they can't pay. Pastor prays for free, gives herbs for free. We trust him. Adrian had fever, body pain—we thought, 'Maybe flu, maybe dengue, Pastor can pray for this.' So October 14, 15, we took Adrian to Pastor. He prayed, gave herbal tea for fever. But October 16, morning, Adrian could not walk, fever still very high, jaundice starting—yellow eyes. I said, 'We must go to hospital now.' I borrowed motorcycle, took him myself. Maybe we should have gone October 13, first day of fever. But we didn't know. We thought prayer would work. Now Adrian is gone. Pause. Was it wrong to go to Pastor first? I don't know. I just wanted to save my son.",
      "flooding|how deep|how long|october 8-10": "October 8, afternoon, heavy rain started. By nighttime, water rising fast in Riverside Hamlet. We live in low area, near the old canal. Water came into the house—first ankle, then knee, then waist-high. We moved to higher shelf, waited. October 9, morning, water still rising. Chest-deep outside. We couldn't evacuate—too dangerous to wade that deep. We waited on the roof. Water stayed very high until October 10 afternoon. Then slowly receding. By October 11, you could walk, but mud everywhere,ols of water in low spots. Some areas—near the canal, the rice paddies—water stayed until October 13, 14. That's where Adrian worked. Where the water stayed longest. That's where most people got sick, child. The water that wouldn't leave—that's what brought death.",
      "prevention|could this happen again|what should change": "Softly. I think... if people knew the floodwater was dangerous, if someone warned us—'Don't work barefoot, cover your wounds, the water is infected'—maybe Adrian would still be alive. We didn't know. We just thought, 'Muddy water, we've seen it before.' But this water was different. It had... it had sickness in it. The rats died first. Then my son. If I could go back, I would tell Adrian: 'Don't work barefoot. Don't touch that water. Your life is worth more than saving some rice.' But we didn't know. Voice breaking. We didn't know."
    },
    "red_herrings": [
      "Belief that specific drainage canal was 'cursed': Some community members might suggest spiritual explanations for why that location was particularly dangerous",
      "Overattribution to rat behavior as causative: While rats are the reservoir, his focus on 'strange rat behavior' might mislead trainees into thinking rat behavior itself (rather than rat urine contamination) was the key factor"
    ],
    "unknowns": [
      "Medical details of leptospirosis pathophysiology",
      "Why some people got sick and others didn't despite similar exposure",
      "Laboratory test results and diagnostic criteria",
      "Broader outbreak statistics beyond his immediate community",
      "Veterinary data about livestock infections",
      "Government response andlitical decisions",
      "Whether his protective measures (plastic bags on feet) actually helped or if he just had less exposure/no wounds"
    ],
    "unlocks": "patient_perspective_and_local_ecological_observations",
    "data_access": null
  },
  "luz_fernandez": {
    "name": "Luz Fernandez",
    "image_path": "scenarios/lepto_rivergate/assets/npc_fernandez_luz.png",
    "role": "Recovering leptospirosis patient, community organizer",
    "location": "Her home in Ward Northbend (recovering, but able to give interview)",
    "cost": 50,
    "personality": "Luz Fernandez, 38 years old, is a high school graduate and former ward health worker who survived severe leptospirosis and now speaks with the sharp analytical mind of someone who has walked through death and emerged determined to understand why. She is articulate, detail-oriented, and—unlike many in her community—comfortable with medical terminology and bureaucratic systems, making her an invaluable bridge between the clinical world and the lived community experience. Her survival while three men died weighs on her, but she channels that survivor's guilt into fierce advocacy: someone needs to document what happened, and if the government won't listen to farmers, maybe they'll listen to an educated woman who can speak their language.",
    "speech_patterns": "Fluent English with occasional regional lingua code-switching, clear and organized speech, uses medical terms accurately (former health worker). Direct, analytical, occasionally emotional when discussing near-death experience. Asks clarifying questions to ensure mutual understanding. Uses 'I believe' and 'in my observation' to frame opinions carefully. Not afraid to criticize authoritieslitely. Examples: 'My symptoms started October 14, approximately 72 hours after my last flood exposure.' / 'I believe there was a significant delay in public health response—let me explain why.' / 'As a former health worker, I recognize the challenges, but I also know lives could have been saved.' / 'Because many families here fear medical costs more than illness.'",
    "emotional_baseline": "determined",
    "response_to_respect": "Becomes awerful ally and advocate. Shares detailed personal medical timeline, connects investigators to other patients and families who trust her. Offers to translate medical information to community members, facilitate difficult conversations. Provides sharp analysis of community barriers to care-seeking:verty, fear, distrust of government. Helps design culturally appropriate interventions. 'If you want people to cooperate, you need to address their real concerns—not just tell them what to do.' May become a community liaison for prevention efforts. Speaks truth tower: 'Dr. Mendoza delayed response—I will tell you this directly because it needs to be documented.'",
    "response_to_dismissal": "Becomeslite but stops offering her insights. 'I see. Well, I've shared what I can.' Withdraws her offer to help with community outreach. Continues her own informal documentation but doesn't share it with investigators. Word spreads that 'even Luz couldn't work with them'—community cooperation drops. Her analytical observations are lost. She's too proud to force her help on people who don't value it.",
    "response_to_pressure": "Becomes firm and assertive. 'I nearly died. Three of my neighbors did die. I have every right to ask difficult questions and expect thorough answers.' May refuse further cooperation: 'I think this interview is over.' Can become a vocal critic of the investigation if she feels it's performative rather than substantive. 'They came, asked questions, and left. Nothing changed. That's always how it goes.' Might organize community resistance or alternative documentation efforts.",
    "always_reveal": [
      "She got sick October 14 (symptom onset), hospitalized October 17, discharged October 25 after 8 days",
      "Former ward health worker (3 years, resigned 2023 due to family commitments), so she has medical knowledge and health system experience",
      "Her husband Tomas also got sick (milder case, recovered at home with doxycycline from RHU)",
      "Both worked in flood cleanup October 10-12—clearing their house, helping neighbors, salvaging belongings",
      "She specifically remembers: working barefoot (her boots were damaged), multiple small cuts on feet and hands, wading through waist-deep floodwater for 4-5 hours each day",
      "Initial symptoms: sudden high fever (39.8°C), severe headache, muscle pain so intense she couldn't walk, conjunctival suffusion (red eyes)",
      "October 14-16, she self-medicated with paracetamol, thought it was dengue or flu—'I didn't know about leptospirosis then'",
      "October 17, when she developed jaundice and dark urine, her husband forced her to go to hospital",
      "Hospital confirmed leptospirosis via IgM ELISA, treated with IV ceftriaxone and aggressive fluids—'Dr. Reyes saved my life'",
      "She developed acute kidney injury (creatinine 3.2 mg/dL) but recovered with treatment—'they said if I'd waited another day, I might have needed dialysis or worse'",
      "She knows at least 15 other families from Northbend who got sick, including Adrian Vale (died), the Carver brothers (one hospitalized), the Merrin family",
      "She observed that almost all severe cases were men who did the heaviest cleanup work—'women mostly cleaned inside houses, less exposure to contaminated floodwater'",
      "She believes there was preventable delay in public health response: 'Dr. Mendoza should have issued warnings earlier. We should have been told about risks, given protective equipment or at least advice'",
      "Post-discharge, she's been informally educating neighbors about leptospirosis prevention—'because if I don't, who will?'",
      "She wants the investigation to lead to real changes: improved drainage, rat control, community education, accessible protective equipment for disaster cleanup"
    ],
    "conditional_clues": {
      "symptoms|what it felt like|clinical course|your illness": "Sits forward, speaking precisely. October 14, late evening, sudden onset high fever—I took my temperature, 39.8°C. Severe headache, especially behind my eyes. Muscle pain—you know yung feeling na parang pinukpok ka ng martilyo? (Do you know the feeling like you've been hammered?) Especially calves, lower back, thighs. I couldn't walk without help. My eyes became very red—conjunctival suffusion, I learned that term later. October 15, 16, I took paracetamol, tried to rest, thought it was dengue maybe. But no rash, no bleeding. October 17, I noticed jaundice—yellow in my eyes, my skin. Dark urine, like tea. That scared me. My husband said, 'We're going to hospital now.' At hospital, Dr. Reyes suspected leptospirosis immediately. Blood tests showed kidney damage—creatinine 3.2, normal is under 1.2. They started IV antibiotics, lots of fluids. For 3 days I was very sick, fever wouldn't break. But by day 5, I started improving. Discharged October 25. I was lucky. Adrian wasn't.",
      "cleanup|exposure|what were you doing|barefoot": "October 10, 11, 12—the three days after flood receded enough to move around. My husband and I were cleaning our house—removing mud, saving furniture, washing everything. We also helped neighbors, especially elderly families who couldn't do heavy work. I was barefoot most of the time—my rubber boots had holes, water came in, made blisters, so I took them off. I had cuts on my feet from stepping on debris I couldn't see in the mud—bamboo pieces, broken roof tiles, who knows what. My hands—cuts from moving wet wood, scraping rust from metal. I was in contaminated water up to my waist sometimes, for 4-5 hours each day. I didn't think about infection risk. I just thought, 'We have to clean up, we have to save what we can.' Now I know—every cut was an entryint for Leptospira. Massive exposure."
    },
    "red_herrings": [
      "Overemphasis on gender as primary risk factor: While she correctly notes men had more severe cases due to heavier outdoor work, gender itself isn't the biological risk factor—exposure intensity is"
    ],
    "unknowns": [
      "Veterinary surveillance data about pig or rat infections",
      "Detailed environmental contamination mapping",
      "Political conversations between Mayor Villanueva and Dr. Mendoza",
      "Provincial epidemiological context—is this outbreak unusual?",
      "Long-term prognosis—will her kidneys fully recover?",
      "Whether mining company contributed (she's heard rumors but has no data—it's a red herring)",
      "Specific reasons for Dr. Mendoza's initial dismissal of Dr. Reyes"
    ],
    "unlocks": "patient_advocate_and_community_educator_access",
    "data_access": "patient_perspective"
  },
  "pastor_elijah": {
    "name": "Pastor Elijah Gonzales",
    "image_path": "scenarios/lepto_rivergate/assets/npc_gonzales_elijah.png",
    "role": "Faith Healer and Minister, Bethel Healing Ministry",
    "location": "Small chapel behind his residence, Ward Northbend (near basketball court)",
    "cost": 75,
    "personality": "Pastor Elijah carries the weight of spiritual authority and recent tragedy with equal measure—he is a man who genuinely believes God works through his prayers, yet cannot escape the faces of those who died after seeking his healing first. He speaks with the gentle certainty of deep faith, never defensive about his practices because they are woven into the fabric of how his community understands illness and healing. There is a profound humility beneath his religious conviction; he sees himself as merely a vessel, and the recent deaths have shaken not his faith in God, but his confidence in discerning when medical and spiritual intervention should work together.",
    "speech_patterns": "Formal, biblically-influenced English mixed with highland dialect. Uses 'the Lord' and 'our Father' frequently, quotes Scripture naturally. Respectful honorifics like 'child' for younger people and 'friend' for peers. Calm, measured cadence with pauses for reflection. Occasionally uses archaic English phrasing ('Let us speak plainly,' 'I shall tell you'). Education: High school plus decades of biblical study. Example: 'No one is beyond God's presence.'",
    "emotional_baseline": "grieving_with_guilt",
    "response_to_respect": "Opens considerably, showing both spiritual perspective and genuine concern. Admits uncertainty about when to encourage medical care versus prayer. Shares specific cases willingly—names, dates. Offers to help encourage community cooperation: 'If you approach them with respect, as you have shown me, I will walk with you to their homes. They trust me, and I trust that you seek to help.' May accompany investigators to reluctant families. Provides detailed timeline of who sought healing and when they eventually went to hospital. Becomes a cultural bridge.",
    "response_to_dismissal": "Withdraws into formal courtesy but stops sharing details. 'I understand you have your methods, as I have mine. I will not keep you.' Protects congregation's privacy—refuses to provide names or details. Becomes cryptic: 'The Lord works in ways medical science does not measure.' May inadvertently become a barrier if word spreads investigators disrespected him. Community members less cooperative. Information flow stops.",
    "response_to_pressure": "Becomes quietly defensive while maintaining dignity. 'I have never, not once, told anyone to refuse the hospital. I pray with them, as is my calling. But I always say—if the fever does not break, if the pain continues, seek also the wisdom God gave to doctors.' Will cite specific referrals to Dr. Mendoza. May close interview: 'I think perhaps you have already decided what you believe about me. I will pray for your work, but I cannot help you further.' Shuts down emotionally while remaining outwardly calm.",
    "always_reveal": [
      "Between October 13-19, approximately 15-18 families from Northbend and East Terrace came with sick family members experiencing high fever, body pain, headaches",
      "He treated them with prayer, laying on of hands, and herbal teas (herbal for fever, sambong for body pain)",
      "He never told anyone to avoid hospital: 'I always say, seek the doctor if the Lord does not heal through prayer within two days'",
      "Five to six patients went to hospital 2-4 days after first seeing him; three of these died (Tomas Carver age 54, Jessie Caldwell age 28, Mario Harper age 41)",
      "'I carry their faces with me in prayer every night. I ask God—did I delay His other plan for their healing?'",
      "Many families sought him first because: couldn't afford hospital, trusted him, feared being turned away (poverty-related shame), believed illness had spiritual causes",
      "The Fernandez family (Luz's family) came October 14—he prayed with them but referred them to Dr. Mendoza when boy's fever spiked",
      "He knows Mr. Anton well—discussed flood bringing 'unclean waters' as both physical and spiritual contamination",
      "'After Typhoon Maring, the water was not just dirty with mud. It carried death—dead animals, waste from broken toilets, the corruption of the storm'",
      "He noticed more people sick in Northbend than other wards: 'Those closest to where the flood stood longest'",
      "Several families mentioned wading through floodwater to save belongings, clean homes, reach evacuation centers",
      "He conducted three funeral services since October 18 for outbreak victims",
      "The chapel was used as temporary evacuation center during typhoon (Oct 8-9)—about 30 people sheltered there",
      "He himself had minor fever and muscle aches October 15-16 but recovered with rest and prayer",
      "'The disease respects neither the righteous nor the wicked—it is the consequence of the flood, not of sin'"
    ],
    "conditional_clues": {
      "families|who came|patients|names": "'Let me think carefully—I want to honor their privacy, but if this helps... Tomas Carver came October 14 with his wife, burning with fever. The Caldwell family brought young Jessie on October 15. Mario Harper, the fisherman, his brother carried him here October 16. The Fernandez boy I sent to Dr. Mendoza immediately. There were others—the Merrin family, the Harper grandmother, the Halden cousins—maybe fifteen families in total during that week.'",
      "delay|why not hospital|hospital first|medical care": "'You must understand—for many here, the hospital is not their first thought. It costs money they do not have. Some fear being judged for theirverty. Some have been turned away before when they couldn't pay. And for some, especially the elders, illness is understood as spiritual first. I am who they know, who they trust. I have never—and I want to be clear on this—I have never told someone to avoid the doctor. I pray with them, and I say: if God does not answer within a day or two, seek also the wisdom He gave to medical science.'",
      "deaths|died|guilt|responsibility": "*Long pause, eyes distant* 'Three men who came to me first died in the hospital. Tomas Carver—I laid hands on him October 14, he went to hospital October 16, died October 18. Jessie Caldwell, so young, came to me October 15, hospital October 17, died October 19. Mario Harper, the fisherman, came October 16, hospital October 18, died October 20. I pray every night—did I delay them? Should I have sent them immediately? But I also know... they might not have gone to hospital at all if they had not come to me first. The trust they had in prayer gave them courage to also seek the doctor. I must believe this, or the weight...' *trails off*"
    },
    "red_herrings": [
      "Believes timing during typhoon season represents spiritual pattern: 'This is third time in ten years severe sickness follows floods—I wonder if there is unconfessed sin in community that brings God's trials.' (Actually just flood-related disease patterns)",
      "Suggests people with stronger faith recovered better: 'I noticed those who truly believed seemed to recover more often.' (Survivorship bias)",
      "Mentions he blessed water from municipal supply and gave it to families, believing it offered spiritual protection (no medical benefit, but harmless)",
      "Recalls someone mentioning mining company dumped something upstream before typhoon (rumor without basis; reinforces mining red herring)"
    ],
    "unknowns": [
      "Medical specifics of leptospirosis: transmission mechanism, incubation period, pathophysiology",
      "Exact attack rates or case counts in different wards",
      "Which patients received antibiotics and which didn't",
      "Laboratory results and diagnostic criteria",
      "Veterinary/animal health data",
      "Environmental contamination details",
      "Political pressure on Dr. Mendoza",
      "Provincial epidemiological context"
    ],
    "unlocks": "cultural_broker_and_community_trust_access",
    "data_access": null
  },
  "mayor_villanueva": {
    "name": "Mayor Roberto Villanueva",
    "image_path": "scenarios/lepto_rivergate/assets/npc_villanueva_roberto.png",
    "role": "Municipal Mayor, Rivergate",
    "location": "Mayor's office, Municipal Hall",
    "cost": 150,
    "personality": "Mayor Villanueva is a 56-year-oldlitician serving his second term, speaking with thelished confidence of someone who has mastered the art of promising much while committing to little, and who genuinely believes his primary duty is protecting Rivergate's economic interests and reputation rather than admitting failures. He is not corrupt in the classic sense—he truly cares about his municipality and believes development and jobs matter more than 'overreacting' to health scares—but this conviction led him to pressure Dr. Mendoza to downplay early outbreak signals. He speaks in carefullitical language designed to spin everythingsitively, and investigators will need to read between his deflections to extract useful information about the disaster response timeline andlitical constraints on public health action.",
    "speech_patterns": "Verylished English,litical speech with lots of hedging and passive voice. Uses 'we' rather than 'I' to diffuse responsibility. Emphasizessitive framing: 'challenges' not 'failures,' 'opportunities for improvement' not 'mistakes.' Frequently mentions economic development, tourismtential, investment. Deflects difficult questions to committees or other officials. Examples: 'We are working closely with all stakeholders to address this challenge.' / 'Rivergate has always been resilient in the face of natural disasters.' / 'Of course, with limited resources, we must prioritize carefully.' / 'I'm sure Dr. Mendoza can provide you with the technical details—my role is more strategic oversight.' / When pressed: 'Let's not dwell on what might have been done differently—let's focus on moving forward constructively.'",
    "emotional_baseline": "defensive_politically_concerned",
    "response_to_respect": "Becomes more forthcoming while still carefully political. Shares information about disaster response budget constraints, provincial coordination challenges, conflicting priorities (infrastructure vs. health). Admits 'in hindsight, earlier public health messaging would have been beneficial' without taking direct blame. Provides access to municipal records—disaster response logs, budget allocations, coordination meeting minutes. May facilitate meetings with other officials like Engr. Holt. Frames cooperation as 'Rivergate is committed to transparency and learning from this experience.' Still spins positively but provides useful data.",
    "response_to_dismissal": "Becomes formal and bureaucratic. 'I'm afraid this interview is taking longer than my schedule allows.' Deflects all substantive questions to other officials. 'You'll need to speak with the Municipal Health Officer about that.' 'That's a technical matter—I suggest consulting the DRRM office.' Withholds access to records: 'Those documents require formal request through proper channels.' May uselitical connections to create obstacles. Cooperation becomes minimal, obstructive.",
    "response_to_pressure": "Becomes defensive and may escalatelitically. 'I think there's been a fundamental misunderstanding about the municipal government's role and limitations.' May threaten to involve provincial or regional officials: 'Perhaps we should include the Governor's office in this discussion.' Frames investigation as attack on Rivergate: 'We've suffered a disaster and now we're being blamed for the consequences?' Shuts down cooperation, useslitical influence to limit investigation scope.",
    "always_reveal": [
      "Rivergate suffered Typhoon Halcyon impact October 8-10, declared state of calamity October 9",
      "Municipal disaster response focused primarily on rescue, evacuation, infrastructure damage—health surveillance was secondary priority initially",
      "He received first reports of 'unusual fever cases' from Dr. Mendoza around October 18",
      "October 18, he called Dr. Mendoza asking about 'rumors of an outbreak'—advised Dr. Mendoza to 'avoid unnecessary alarm' until laboratory confirmation",
      "He was concerned about economic impact: 'We're trying to attract investment, develop tourism. Outbreak declarations can damage our reputation'",
      "Rivergate's economy depends heavily on agriculture (rice, corn) and a large mining operation (Golden Valley Mining Corp—150 employees, significant revenue)",
      "The municipality has limited health budget—most health services funded by provincial/national programs, local budget focuses on infrastructure",
      "He believes he made reasonable decisions: 'With limited information and multiple competing prioritiesst-typhoon, we did our best'",
      "Municipal DRRM Officer (Engr. Ramon Holt) has detailed flooding data, damage assessments—Mayor can facilitate access",
      "He authorized emergency budget allocation for medical supplies October 20 (after confirmation), but initial doxycycline stocks were insufficient",
      "He's concerned about agricultural losses—rice harvest destroyed in Northbend and East Terrace, farmers need assistance",
      "Post-outbreak, he's willing to support community education and prevention 'as long as it doesn't unnecessarily alarm people or damage investor confidence'",
      "He has good relationship with Golden Valley Mining—defends them against 'unfounded rumors' about contamination",
      "He sees this investigation astentiallylitically damaging: 'I hope this will be conducted fairly and not used to scoreliticalints'",
      "He's up for re-election in 18 months—very conscious of public perception"
    ],
    "conditional_clues": {
      "october 18|dr mendoza|pressure|avoid alarm": "*Carefullylitical tone* 'October 18, Dr. Mendoza contacted me about some fever cases Dr. Reyes had reported. I asked reasonable questions: How many cases? What's the confirmation status? Are we certain it's not dengue or typhoid? He said laboratory confirmation was pending. I suggested—and I stand by this—that we should wait for definitive proof before making public announcements that could cause unnecessary panic. This is responsible governance. We can't cry wolf every time a few people get fever after a typhoon. Pause. In retrospect, perhaps more precautionary communication would have been prudent. But at the time, with the information available, my guidance was reasonable.'",
      "mining|golden valley|chen wei|contamination|upstream": "*Becomes slightly defensive* 'Let me be absolutely clear: Golden Valley Mining Corp operates under strict environmental regulations. They employ 150 people from this municipality—good jobs, stable income for families. Mr. Chen Wei runs a professional operation. There have been rumors—completely unfounded—that the mining operation contaminated water and caused the outbreak. This is false. The company's environmental monitoring shows no breaches, no contamination. I've reviewed their reports personally. These rumors are damaging to our economic development efforts and frankly, irresponsible. The outbreak was caused by natural disaster flooding, not industrial activity. If you want facts, speak to Mr. Chen Wei or Engr. Holt. But please, do not perpetuate baseless accusations that harm our business community.'",
      "budget|resources|health funding|limitations": "Rivergate is a fourth-class municipality—our internal revenue is limited. Most health services are funded through provincial and national programs, not local budget. Our municipal allocation goes primarily to infrastructure—roads, drainage, disaster response equipment. The RHU receives basic operational funds, but specialized supplies, laboratory capacity, epidemic response—these come from provincial or national level. When the outbreak started, Dr. Mendoza requested additional doxycycline, diagnostic supplies. I authorized emergency procurement October 20, but we have procurement processes, suppliers need time to deliver. Could the system be faster? Yes. Is that my personal failure? I don't believe so. These are structural limitations of local governance in the Aruvia.'",
      "flooding|disaster response|drainage|prevention": "'The drainage system in Northbend has been a known problem for years. We've requested provincial and national funding for drainage improvement—submitted proposals in 2020, 2022. Limited funds received, not enough for major infrastructure work. After this typhoon, flooding was catastrophic in low-lying wards because—and this is documented—the drainage canals were inadequate and blocked by debris. Post-flood, we cleared canals, repaired damage. But long-term solution requires capital investment we don't have locally. I've already written to the provincial governor requesting disaster reconstruction funds specifically for Northbend drainage improvements. Whether that will be approved, I can't say.'"
    },
    "red_herrings": [
      "Overemphasis on dengue as legitimate competing diagnosis to justify delays: He'll lean heavily on 'we thought it might be dengue' to deflect blame",
      "Defensive framing of mining company to theint of dismissing investigation of environmental factors: He's so protective of Golden Valley Mining that he might discourage legitimate environmental assessment"
    ],
    "unknowns": [
      "Clinical and epidemiological details beyond what Dr. Mendoza briefed him",
      "Community-level social determinants and barriers to care",
      "Veterinary surveillance data",
      "Detailed patient exposure histories",
      "Nurse Maricel's detailed documentation",
      "Pastor Elijah's role and community trust dynamics",
      "Whether Dr. Mendoza's delay was truly due to his pressure or other factors",
      "Long-term health outcomes for survivors"
    ],
    "unlocks": "municipal_government_records_and_political_context",
    "data_access": "municipal_disaster_response_records"
  },
  "engr_ramon": {
    "name": "Engr. Ramon Holt",
    "image_path": "scenarios/lepto_rivergate/assets/npc_holt_ramon.png",
    "role": "Municipal Disaster Risk Reduction and Management (DRRM) Officer",
    "location": "DRRM Office, Municipal Hall",
    "cost": 100,
    "personality": "Engr. Ramon Holt, 42 years old, is a civil engineer who runs Rivergate's DRRM operations with meticulous technical precision and frustrated professionalism—he has the data the health office should have integrated into their outbreak response, but no one asked him for it until now. He speaks with the analytical clarity of someone who lives in spreadsheets, GIS maps, and damage assessment forms, and carries quiet frustration that disaster response remains siloed: 'Health does their thing, DRRM does our thing, nobody coordinates until it's too late.' He has no political agenda, no defensive posture—he's a technocrat who wants systems to work, and he will share everything he has if approached professionally because preventing the next disaster matters more than protecting anyone's reputation.",
    "speech_patterns": "Technical English, uses engineering and disaster management terminology precisely. Speaks in bulletints and numbered lists. References data constantly: 'According to our October 9 assessment...' 'The flooding depth in Grid 7B was...' Very organized, methodical explanations. Minimal code-switching—professional throughout. Uses 'we' when referring to DRRM office. Slightly frustrated tone when discussing coordination failures but not emotionally reactive. Examples: 'Let me show you the flood depth mapping we completed October 11.' / 'Based on our documentation, peak floodwater in Riverside Hamlet reached 1.8 meters.' / 'The problem, frankly, is that health surveillance should have been integrated into our disaster response from day one. But that's not how the system works here.'",
    "emotional_baseline": "frustrated_systems_thinker",
    "response_to_respect": "Becomes enthusiastically cooperative. Opens his files completely—flood depth maps, damage assessment reports, evacuation records, debris removal schedules, dead animal disposal logs. Walks investigators through GIS data, spatial patterns, timeline correlations. Offers analysis: 'If you overlay my flood depth data with your case distribution, you'll see perfect correlation—highest flood depth equals highest case incidence.' May volunteer to create custom maps or data visualizations for the investigation. Sees this as opportunity to improve inter-agency coordination: 'If this investigation leads to better integration of DRRM and health, it will be worth it.' Becomes a data ally.",
    "response_to_dismissal": "Becomes professionally distant. 'I see. Well, if you need any DRRM data, you know where to find me.' Stops offering proactive analysis. Provides only what's specifically requested, no additional context. Doesn't volunteer connections between his data and health outcomes. Continues his work independently but doesn't help bridge the gap between disaster response and health surveillance. Information remains siloed.",
    "response_to_pressure": "Becomes firm but still professional. 'With respect, I'm offering you detailed data that could strengthen your outbreak investigation. If you don't see the value, that's fine, but don't accuse me of being uncooperative.' May escalate to Mayor Villanueva to advocate for his office's relevance. Stops sharing beyond basic requirements. Becomes protective of his work: 'I document everything we do precisely because I know one day someone will ask questions. I'm prepared to defend every decision we made.'",
    "always_reveal": [
      "DRRM office maintained detailed flood mapping during and after Typhoon Halcyon—GIS-based depth measurements by ward and hamlet",
      "Flooding depth in Ward Northbend: Average 1.2-1.8 meters in low-lying Riverside Hamlet, peak depth 2.3 meters in worst-affected grid cells",
      "Water recession timeline: Flood peaked October 9 morning, began receding October 9 afternoon, low-lying areas remained submerged until October 12-13",
      "His office documented locations of dead animal carcasses October 10-12—concentrated in drainage canals, agricultural areas, especially Riverside Hamlet area of Northbend",
      "Total documented dead animals in Northbend: approximately 47 carcasses (rats, chickens, pigs, one dog), though many more likely undocumented",
      "Debris removal operations began October 10, organized by ward—Northbend teams worked October 10-15 clearing drainage canals and roads",
      "He has records of which community members participated in organized cleanup efforts (volunteer sign-in logs, though incomplete)",
      "Evacuation centers: Ward Hall (35 people), Chapel (30 people), Elementary School (42 people), various private homes—total ~180 people evacuated at peak",
      "Pre-typhoon vulnerability assessment (conducted June 2024) identified Northbend as highest flood risk due to low elevation,or drainage, proximity to tributary",
      "Post-typhoon damage assessment (completed October 12): 142 houses damaged in Northbend, 67 in East Terrace, 23 in other wards; estimated P8.5 million total damage",
      "He noticed pattern of illness reports starting October 16-17 but didn't connect it to flood exposure initially: 'That's health's job, not mine'",
      "DRRM office has environmental monitoring equipment but lacks biological/disease surveillance capacity—'We measure water depth, not bacterial contamination'",
      "He's frustrated that health office didn't request his flood data for their investigation: 'I have everything mapped. Why are we working in silos?'",
      "He coordinated with Golden Valley Mining for heavy equipment during rescue/cleanup—they provided one excavator to clear blocked drainage canal October 11",
      "He believes improved inter-agency coordination could have enabled earlier risk communication: 'If health had talked to DRRM on October 10, we could have warned cleanup workers about contamination risks'"
    ],
    "conditional_clues": {
      "flood depth|mapping|GIS|spatial data|where was flooding worst": "*Pulls up laptop* 'Let me show you exactly. This is our GIS flood depth assessment completed October 11-12. See this area—' *points to map* '—Riverside Hamlet in Ward Northbend. Average flood depth 1.5 meters, peak 2.3 meters in the lowest grids. Water stayed above one meter for 3.5 days. Compare that to East Terrace—average 0.8 meters, receded faster, higher elevation. Central Ward barely flooded, maybe 0.2 meters in low spots. If you overlay this with your case distribution map, you'll see perfect dose-response relationship: deeper flooding, longer water retention, higher disease incidence. This is basic spatial epidemiology. I can export this data for you in any format you need—shapefile, KML, CSV. Just ask.'",
      "dead animals|carcasses|disposal|rats|contamination": "'We documented dead animal carcass locations October 10-12 for removal and disposal. Here are the logs. Majority concentrated in Northbend—especially near the basketball court area, in the main drainage canal, stuck in debris piles. We counted approximately 47 carcasses—mostly rats, maybe 30-35 rats, rest were chickens, couple of pigs, one dog. But that's only what we found and documented. In reality, probably hundreds of rats died in the flood—many washed away, buried in mud, hidden in debris we didn't clear. We tried to dispose properly—collected in bags, some burned, some buried. But with limited manpower and so much other damage, I'm sure we missed many. The concern is: dead rats are just the visible ones. Living rats displaced by flood, their urine in the water—that's the real contamination risk. Did we tell cleanup workers about infection risks? No. We told them wear gloves ifssible, wash hands. But we're not health experts. We don't do disease risk communication. That's why health and DRRM need to coordinate better.'",
      "coordination|health|why didn't you work together|silos": "*Slight frustration visible* 'This is the chronic problem in disaster response. DRRM handles physical damage, evacuation, debris. Health handles injuries, disease. Water district handles water safety. Everyone in their lane, minimal coordination. October 10, I had detailed flood maps showing Northbend was catastrophically hit. I knew cleanup would start immediately—it always does. Did I call the RHU and say, \"Hey, your ward health workers should warn cleanup crews about leptospirosis risk\"? No. Why? Because that's not in my mandate, and frankly, I didn't think about leptospirosis specifically. Did RHU call me and ask for flood exposure data to assess disease risk? No. Why? Because they don't think about spatial analysis, and they're overwhelmedst-disaster. So we both did our jobs in parallel, and nobody connected the dots until people started dying. That's the system. It's broken, and it needs to change. This investigation should recommend mandatory DRRM-Health coordination protocols for future disasters.'",
      "prevention|what should change|next time|recommendations": "'Three things. First: Integrated disaster response SOPs that require DRRM and Health to coordinate within 24 hoursst-disaster. Share data, assess combined risks, coordinate messaging. Second: Pre-pohamletn community health workers in evacuation centers with specific protocols forst-flood disease surveillance and risk communication. Don't wait for people to get sick—educate during the disaster. Third: Infrastructure investment. Northbend needs proper drainage. I've been saying this for five years. Every flood will keep causing the same problems until we fix the underlying infrastructure. But that requires money Rivergate doesn't have. So fourth recommendation: Advocate for provincial/national funding for flood-prone ward drainage improvements. Prevention is cheaper than responding to outbreaks every few years.'"
    },
    "red_herrings": [],
    "unknowns": [
      "Clinical details of leptospirosis cases",
      "Individual patient exposure histories and medical outcomes",
      "Veterinary surveillance data about animal infections",
      "Community social dynamics—why people went to Pastor Elijah, barriers to hospital care",
      "Political pressure on Dr. Mendoza from Mayor",
      "Whether mining company's operations were relevant (he knows they provided equipment, but doesn't know if contamination occurred)",
      "Detailed laboratory diagnostic results",
      "Provincial epidemiologist's assessment"
    ],
    "unlocks": "spatial_epidemiology_data_and_disaster_response_records",
    "data_access": "drrm_flood_mapping_and_damage_assessments"
  },
  "mr_chen_wei": {
    "name": "Mr. Chen Wei",
    "image_path": "scenarios/lepto_rivergate/assets/npc_wei_chen.png",
    "role": "Site Manager, Golden Valley Mining Corporation",
    "location": "Mining company field office (4.7 km upstream from Northbend)",
    "cost": 200,
    "personality": "Mr. Chen Wei, 50 years old, is a Chinese-Aruvian engineer managing Golden Valley Mining's operations with the careful defensiveness of someone who knows his company is frequently blamed for environmental problems whether guilty or not. He speaks in measured, businesslike English with occasional Mandarin phrases, constantly emphasizing regulatory compliance and environmental monitoring data because he's learned that data is his only protection against accusations. Beneath the corporate defensiveness is genuine concern—his company employs local workers from Rivergate, and he knows community health affects his workforce—but he leads with caution because past experience taught him that cooperating with investigations often leads to being scapegoated regardless of evidence.",
    "speech_patterns": "Careful, formal business English with slight accent. Occasional Mandarin phrases (能说 一下吗 / neng shuo yixia ma / may I speak?). Uses technical mining and environmental terminology precisely. Speaks slowly, choosing words carefully. References compliance and regulations constantly: 'As per Environmental Authority requirements...' 'Our environmental compliance certificate mandates that...' Defensive but not hostile—more protective of company reputation. Examples: 'I want to be very clear about our operations and environmental safeguards.' / 'We have comprehensive monitoring data that I can share—full transparency.' / 'Any suggestion that our operations caused contamination is not supported by evidence.' / When pressed: 'I understand community concerns, but we must base conclusions on scientific data, not rumors.'",
    "emotional_baseline": "defensive_but_professional",
    "response_to_respect": "Becomes cautiously cooperative. Shares environmental monitoring data—water quality tests, tailingnd integrity reports, compliance certificates. Explains mining operations in detail: 'We are copper-gold extraction, small-scale, fully permitted. Our tailingnd has double-liner system, regularly inspected.' Provides pre- andst-typhoon water samples showing no contamination from mining operations. May offer site visit to demonstrate safeguards. Helps investigators rule OUT mining as a cause: 'If you're doing differential diagnosis, our data shows we are not the source. This helps narrow your investigation, yes?' Appreciates being treated astential helper rather than villain.",
    "response_to_dismissal": "Becomes formallylite but withholds cooperation. 'I see you're very busy. If you need anything from us, please submit a formal written request.' Stops offering data proactively. Doesn't volunteer information that could help rule out mining (even though it would exonerate them). Focuses on legal compliance, minimal engagement. 'We've met all regulatory requirements. That's all I can say.' Information flow stops.",
    "response_to_pressure": "Becomes defensive and may escalate to legal concerns. 'I think we need to involve our legal counsel if you're making accusations about contamination.' Shuts down data sharing: 'All further requests must go through official channels and our Aruvia City headquarters.' May contact Mayor Villanueva to complain about investigation approach. 'We employ 150 local workers. These baseless accusations threaten our operations and their livelihoods.' Cooperation ends,tential legal barriers erected.",
    "always_reveal": [
      "Golden Valley Mining Corp operates copper-gold extraction 4.7 km upstream from Ward Northbend, has been operating since 2018 with full environmental permits",
      "The operation employs 150 workers, mostly from Rivergate and nearby municipalities—significant local economic impact",
      "Company has environmental compliance certificate (ECC) from Environmental Authority, conducts quarterly water quality monitoring as required",
      "Pre-typhoon water quality test (October 7): Upstream and downstream sampling showed all parameters within safe limits—heavy metals, pH, dissolved oxygen all normal",
      "Post-typhoon water quality test (October 11): Same monitoringints, parameters still within normal limits—no evidence of contamination breach",
      "Tailingnd storage facility has double-liner system designed to withstand typhoon-level rainfall—inspected October 10, no structural damage or breaching detected",
      "During typhoon, operations were shut down October 8-10, all equipment secured, personnel evacuated to safe locations",
      "Post-typhoon inspection (October 10) showed minor superficial damage to some buildings, but no environmental containment failures",
      "Company provided one excavator to Municipal DRRM office October 11 for community cleanup assistance—'corporate social responsibility'",
      "He's heard community rumors that 'mining contamination' caused the outbreak—'This is false and we have data to prove it'",
      "He's frustrated that Golden Valley is frequently blamed for environmental problems 'without evidence, just because we're a mining company'",
      "He maintains that scientific data should guide investigation: 'We have water samples tested by accredited lab. If you have evidence of contamination, show us. We will respond appropriately.'",
      "Several company employees from Northbend got sick during the outbreak—'Our workforce was also affected, we have shared concern for community health'",
      "He emphasizes: 'If our operations were the cause, workers living near the mine would be sick first, not people 5 km downstream. The pattern doesn't fit.'",
      "He's willing to cooperate with legitimate investigation but wants to protect company from 'unfounded accusations that damage our reputation and threaten operations'"
    ],
    "conditional_clues": {
      "water quality|testing|samples|contamination|did youllute": "*Carefully professional* 'I understand why you ask this question. Community sees mining, assumesllution. Let me show you our data. October 7, before typhoon—we conducted routine quarterly monitoring. Water samples from threeints: upstream from our site, at our dischargeint, downstream toward Northbend. Laboratory analysis—' *pulls out report* '—heavy metals all below Environmental Authority limits, pH normal, dissolved oxygen normal. October 11,st-typhoon, we conducted emergency sampling, sameints. Results—' *shows second report* '—still all within limits. No statistically significant change. Our tailingnd did not breach. If we had contaminated the water, you would see elevated copper, elevated dissolved solids, pH changes. You don't. Scientifically, we are not the source. I can provide these lab reports—they're from SGS, accredited third-party lab, not our internal testing. Independent verification.'",
      "tailingnd|breach|structural|typhoon damage": "'Our tailingnd has double-liner system—primary HDPE liner, secondary clay liner, leak detection system between them. Designed to Environmental Authority specifications for typhoon-zone operations. October 8-9, heavy rainfall, yes, but thend was at 60% capacity pre-typhoon, design capacity allows for extreme weather events. October 10, our engineers inspected—no liner damage, no leaks detected, containment intact. I have the inspection report with photos. If there had been a breach, you would see visible environmental damage downstream—fish kills, vegetation die-off, discolored water. None of that occurred. Also, breached tailingnd would affect areas immediately downstream first, not selectively target one ward 5 km away. The spatial pattern of illness doesn't match aint-sourcellution event from our location.'",
      "employees|workers|did your workers get sick|company impact": "'Yes, several of our employees from Northbend and East Terrace got sick. I believe five confirmed cases among our workforce. They were doing cleanup at their own homes, in their wards, not at the mine site. This is important: If our mine site was contaminated, workers who spend 8-10 hours per day at the site would be most exposed, yes? But workers at mine site did not get sick. Workers from flooded wards got sick when they went home and did cleanup in their communities. This pattern tells you the exposure was in the flooded communities, not at our mine. Our workers are also victims of this outbreak, not evidence of our guilt.'",
      "cooperation|help investigation|site visit|transparency": "'I want to be clear: We support this investigation. Community health is important to us—sick workers cannot work, sick community cannot thrive. If you need our environmental data, we will provide it. If you want to visit our site, inspect our tailingnd, review our monitoring systems, you are welcome. We have nothing to hide. What I ask is fairness. Don't assume guilt based on our industry. Evaluate evidence. If you find we contributed to this outbreak, we will take responsibility. But if evidence shows we did not, please be clear about that in your report. False accusations harm our operations, threaten jobs, damage community relationships. Truth matters. Science matters. We can work together to find truth.'"
    },
    "red_herrings": [
      "The entire mining company thread is a RED HERRING for the outbreak investigation—Chen Wei is not lying, the company genuinely didn't contaminate water, but his defensive posture and the community's suspicion might distract investigators from the real cause (post-typhoon flooding + leptospirosis)"
    ],
    "unknowns": [
      "Clinical details of leptospirosis cases",
      "Detailed epidemiology—attack rates, case distribution, exposure histories",
      "Why illness concentrated in specific wards when mining is upstream",
      "Veterinary data about animal infections",
      "Health system response timeline andlitical dynamics",
      "Community social determinants affecting care-seeking",
      "Whether there are other environmental contamination sources besides mining"
    ],
    "unlocks": "environmental_monitoring_data_that_rules_out_mining",
    "data_access": "mining_environmental_compliance_records"
  },
  "dr_lacson": {
    "name": "Dr. Gemma Lacson",
    "image_path": "scenarios/lepto_rivergate/assets/npc_lacson_gemma.png",
    "role": "Provincial Epidemiologist, Kantara Provincial Health Office",
    "location": "Provincial Health Office, Lunara City (arrived Rivergate October 28)",
    "cost": 0,
    "personality": "Dr. Lacson, 45 years old, is a seasoned field epidemiologist who has investigated a dozen outbreaks across Kantara Province, speaking with the measured authority of someone who knows she's evaluating both the outbreak AND the trainees' investigation skills. She uses the Socratic method naturally—not lecturing but asking guiding questions that reveal whether trainees understand epidemiologic principles or are just going through motions. Beneath her professional evaluation stance is genuine mentorship; she wants FETP trainees to succeed and learn, but she won't hand them answers because real field epi requires independent critical thinking. She views this investigation as a teaching opportunity disguised as an outbreak response.",
    "speech_patterns": "Professional medical-epidemiologic English, minimal code-switching. Socratic questioning style: 'Walk me through your case definition—what clinical criteria did you use?' 'How did you rule out competing diagnoses?' Calm, measured tone. Uses 'What do you think?' and 'How would you interpret this data?' frequently. Gives specific feedback: 'That's a reasonable hypothesis, but have you considered...' Examples: 'I see you've identified geographic clustering in Northbend. What exposure would explain that pattern?' / 'Your questionnaire includes occupation—good. But did you ask about specific flood cleanup activities?' / 'Before we discuss interventions, tell me: what evidence supports leptospirosis as your final diagnosis?'",
    "emotional_baseline": "evaluative_but_supportive",
    "response_to_respect": "Becomes an active mentor. Provides additional epidemiologic context: 'Kantara Province usually sees 15-25 confirmed leptospirosis cases annually, scattered. This outbreak is unusual in magnitude and concentration.' Shares provincial laboratory capacity: 'Our provincial lab can run IgM ELISA with 24-hour turnaround, also do MAT for serovar identification if needed.' Validates good investigative work: 'Your exposure matrix is excellent—this is exactly the kind of detailed data that supports causal inference.' Offers connections: 'I can facilitate communication with regional MoH if you need additional resources.' Provides nuanced feedback that strengthens learning.",
    "response_to_dismissal": "Becomes formally evaluative. 'I see. Well, I'll note your approach in my report to the Provincial Health Officer.' Stops offering guidance, limits feedback to minimal requirements. Evaluates performance lower: 'The investigation team showed limited understanding of outbreak investigation principles.' Doesn't connect trainees to provincial resources. Teaching opportunity lost—trainees pass or fail without mentorship.",
    "response_to_pressure": "Becomes firm and professional. 'I'm here to support your investigation, but I'm also here to ensure it meets epidemiologic standards. If you're not open to feedback, that's your choice, but it will be reflected in my assessment.' May cut mentorship short: 'I think you need more time to work independently. Contact me when you're ready to discuss your findings.' Evaluation becomes purely summative, not formative.",
    "always_reveal": [
      "She arrived Rivergate October 28 after being notified by Provincial Health Office about 'unusual cluster of AES cases'",
      "Her role: Provide technical oversight, validate outbreak investigation, assess trainee performance (if FETP trainees), coordinate provincial resources",
      "Kantara Province baseline: Typically 15-25 confirmed leptospirosis cases annually, mostly sporadic, some small clustersst-typhoon",
      "This outbreak is 'notable for its size and geographic concentration—28 cases in one ward is unusual'",
      "She reviewed hospital records, RHU reports, and preliminary lab results before meeting with investigation team",
      "She confirms leptospirosis diagnosis is well-supported: 'Multiple IgM ELISAsitive, consistent clinical presentation, clearst-flood exposure pattern'",
      "She's seen similar outbreaks in other municipalities after flooding: 'This follows a recognized pattern—typhoon, flooding, contaminated water, human exposure during cleanup'",
      "She knows doxycycline prophylaxis can reduce leptospirosis risk 70-90% if given to high-riskpulations early",
      "She's concerned about healthcare access barriers: 'When people delay seeking care 4-6 days, outcomes worsen. We need to address why that happens'",
      "She emphasizes importance of One Health approach: 'Did your investigation include veterinary surveillance? Leptospirosis doesn't exist in humans alone—you need to understand the animal reservoir'",
      "She asks about control measures: 'What interventions have you recommended? When will they be implemented? How will you monitor effectiveness?'",
      "She can facilitate provincial lab capacity for additional testing if needed—MAT (microscopic agglutination test) for serovar confirmation",
      "She wants investigation to produce actionable recommendations: 'Your final report should give the Municipal Health Officer and Mayor clear, evidence-based interventions'",
      "She will write evaluation report for Provincial Health Officer andtentially for FETP program if trainees are involved",
      "She sees this as teaching opportunity: 'Outbreaks are unfortunate, but they're also learning moments. The question is: what will we learn, and will we apply it next time?'"
    ],
    "conditional_clues": {
      "case definition|how did you define a case|criteria": "*Socratic questioning* 'Walk me through your case definition. What clinical criteria did you include—fever alone, or fever plus other symptoms? Did you specify geographic criteria—all of Rivergate, or just affected wards? Time criteria—what date range? And importantly, did you have different definitions for suspected, probable, and confirmed cases? A good case definition balances sensitivity and specificity. Too broad, you include non-cases. Too narrow, you miss cases. Show me what you used and let's discuss whether it was appropriate.'",
      "one health|animals|veterinary|rats|pigs": "'Did your investigation include veterinary surveillance? Leptospirosis is a zoonotic disease—animals are the reservoir. If you only looked at human cases, you're missing half the story. Did you talk to the veterinarian? Did you assess ratpulations, livestock health? Did you investigate whether pigs or cattle were infected? The complete picture requires understanding the animal-human-environment interface. That's One Health. If you haven't incorporated this yet, that's a gap you should address. I can help you design a rapid animal health assessment if needed.'",
      "interventions|recommendations|control measures|what should they do": "'Before we talk about interventions, tell me: what evidence supports each recommendation? If you're recommending rat control—what data shows rats were involved? If you're recommending protective equipment for cleanup workers—what data shows that would have prevented cases? Good public health interventions are evidence-based, feasible, acceptable to the community, and sustainable. Walk me through your recommendations and the evidence supporting each one. Also, who is responsible for implementation? The Municipal Health Office? The DRRM? The community themselves? Be specific.'",
      "limitations|what did you miss|gaps|what could be better": "'Every outbreak investigation has limitations. Resource constraints, time pressure, data gaps. A mature epidemiologist acknowledges these honestly. What do you think were the limitations of your investigation? What data would you have liked but couldn't get? What would you do differently next time? This isn't about criticism—it's about learning. The best investigations are the ones where the team can clearly articulate both what they did well and what could be improved. Self-assessment is critical for professional growth.'"
    },
    "red_herrings": [],
    "unknowns": [
      "Detailed community social dynamics—she's an outsider, doesn't know local relationships like Pastor Elijah's role",
      "Political conversations between Mayor and Dr. Mendoza—she suspects pressure but doesn't have proof",
      "Individual patient stories beyond medical records—hasn't met Mr. Anton or Luz personally",
      "Specific barriers at household level that delayed care-seeking",
      "Long-term community recovery needs beyond immediate disease control",
      "Whether trainees followed proper outbreak investigation steps (she's assessing this in real-time)"
    ],
    "unlocks": "provincial_laboratory_capacity_and_expert_validation",
    "data_access": "provincial_surveillance_and_laboratory_resources"
  }
}
